GopalSaraf/Practicals/PSDL/include/proc/pic16lf1789.inc
// Register: SLRCOND
#define SLRCOND SLRCOND
SLRCOND                                  equ 030Fh
// bitfield definitions
SLRCOND_SLRCOND0_POSN                    equ 0000h
SLRCOND_SLRCOND0_POSITION                equ 0000h
SLRCOND_SLRCOND0_SIZE                    equ 0001h
SLRCOND_SLRCOND0_LENGTH                  equ 0001h
SLRCOND_SLRCOND0_MASK                    equ 0001h
SLRCOND_SLRCOND1_POSN                    equ 0001h
SLRCOND_SLRCOND1_POSITION                equ 0001h
SLRCOND_SLRCOND1_SIZE                    equ 0001h
SLRCOND_SLRCOND1_LENGTH                  equ 0001h
SLRCOND_SLRCOND1_MASK                    equ 0002h
SLRCOND_SLRCOND2_POSN                    equ 0002h
SLRCOND_SLRCOND2_POSITION                equ 0002h
SLRCOND_SLRCOND2_SIZE                    equ 0001h
SLRCOND_SLRCOND2_LENGTH                  equ 0001h
SLRCOND_SLRCOND2_MASK                    equ 0004h
SLRCOND_SLRCOND3_POSN                    equ 0003h
SLRCOND_SLRCOND3_POSITION                equ 0003h
SLRCOND_SLRCOND3_SIZE                    equ 0001h
SLRCOND_SLRCOND3_LENGTH                  equ 0001h
SLRCOND_SLRCOND3_MASK                    equ 0008h
SLRCOND_SLRCOND4_POSN                    equ 0004h
SLRCOND_SLRCOND4_POSITION                equ 0004h
SLRCOND_SLRCOND4_SIZE                    equ 0001h
SLRCOND_SLRCOND4_LENGTH                  equ 0001h
SLRCOND_SLRCOND4_MASK                    equ 0010h
SLRCOND_SLRCOND5_POSN                    equ 0005h
SLRCOND_SLRCOND5_POSITION                equ 0005h
SLRCOND_SLRCOND5_SIZE                    equ 0001h
SLRCOND_SLRCOND5_LENGTH                  equ 0001h
SLRCOND_SLRCOND5_MASK                    equ 0020h
SLRCOND_SLRCOND6_POSN                    equ 0006h
SLRCOND_SLRCOND6_POSITION                equ 0006h
SLRCOND_SLRCOND6_SIZE                    equ 0001h
SLRCOND_SLRCOND6_LENGTH                  equ 0001h
SLRCOND_SLRCOND6_MASK                    equ 0040h
SLRCOND_SLRCOND7_POSN                    equ 0007h
SLRCOND_SLRCOND7_POSITION                equ 0007h
SLRCOND_SLRCOND7_SIZE                    equ 0001h
SLRCOND_SLRCOND7_LENGTH                  equ 0001h
SLRCOND_SLRCOND7_MASK                    equ 0080h
SLRCOND_SLRCOND_POSN                     equ 0000h
SLRCOND_SLRCOND_POSITION                 equ 0000h
SLRCOND_SLRCOND_SIZE                     equ 0008h
SLRCOND_SLRCOND_LENGTH                   equ 0008h
SLRCOND_SLRCOND_MASK                     equ 00FFh

// Register: SLRCONE
#define SLRCONE SLRCONE
SLRCONE                                  equ 0310h
// bitfield definitions
SLRCONE_SLRCONE0_POSN                    equ 0000h
SLRCONE_SLRCONE0_POSITION                equ 0000h
SLRCONE_SLRCONE0_SIZE                    equ 0001h
SLRCONE_SLRCONE0_LENGTH                  equ 0001h
SLRCONE_SLRCONE0_MASK                    equ 0001h
SLRCONE_SLRCONE1_POSN                    equ 0001h
SLRCONE_SLRCONE1_POSITION                equ 0001h
SLRCONE_SLRCONE1_SIZE                    equ 0001h
SLRCONE_SLRCONE1_LENGTH                  equ 0001h
SLRCONE_SLRCONE1_MASK                    equ 0002h
SLRCONE_SLRCONE2_POSN                    equ 0002h
SLRCONE_SLRCONE2_POSITION                equ 0002h
SLRCONE_SLRCONE2_SIZE                    equ 0001h
SLRCONE_SLRCONE2_LENGTH                  equ 0001h
SLRCONE_SLRCONE2_MASK                    equ 0004h
SLRCONE_SLRCONE_POSN                     equ 0000h
SLRCONE_SLRCONE_POSITION                 equ 0000h
SLRCONE_SLRCONE_SIZE                     equ 0003h
SLRCONE_SLRCONE_LENGTH                   equ 0003h
SLRCONE_SLRCONE_MASK                     equ 0007h

// Register: CCPR3L
#define CCPR3L CCPR3L
CCPR3L                                   equ 0311h
// bitfield definitions
CCPR3L_CCPR3L_POSN                       equ 0000h
CCPR3L_CCPR3L_POSITION                   equ 0000h
CCPR3L_CCPR3L_SIZE                       equ 0008h
CCPR3L_CCPR3L_LENGTH                     equ 0008h
CCPR3L_CCPR3L_MASK                       equ 00FFh

// Register: CCPR3H
#define CCPR3H CCPR3H
CCPR3H                                   equ 0312h
// bitfield definitions
CCPR3H_CCPR3H_POSN                       equ 0000h
CCPR3H_CCPR3H_POSITION                   equ 0000h
CCPR3H_CCPR3H_SIZE                       equ 0008h
CCPR3H_CCPR3H_LENGTH                     equ 0008h
CCPR3H_CCPR3H_MASK                       equ 00FFh

// Register: CCP3CON
#define CCP3CON CCP3CON
CCP3CON                                  equ 0313h
// bitfield definitions
CCP3CON_CCP3M_POSN                       equ 0000h
CCP3CON_CCP3M_POSITION                   equ 0000h
CCP3CON_CCP3M_SIZE                       equ 0004h
CCP3CON_CCP3M_LENGTH                     equ 0004h
CCP3CON_CCP3M_MASK                       equ 000Fh
CCP3CON_DC3B_POSN                        equ 0004h
CCP3CON_DC3B_POSITION                    equ 0004h
CCP3CON_DC3B_SIZE                        equ 0002h
CCP3CON_DC3B_LENGTH                      equ 0002h
CCP3CON_DC3B_MASK                        equ 0030h
CCP3CON_CCP3M0_POSN                      equ 0000h
CCP3CON_CCP3M0_POSITION                  equ 0000h
CCP3CON_CCP3M0_SIZE                      equ 0001h
CCP3CON_CCP3M0_LENGTH                    equ 0001h
CCP3CON_CCP3M0_MASK                      equ 0001h
CCP3CON_CCP3M1_POSN                      equ 0001h
CCP3CON_CCP3M1_POSITION                  equ 0001h
CCP3CON_CCP3M1_SIZE                      equ 0001h
CCP3CON_CCP3M1_LENGTH                    equ 0001h
CCP3CON_CCP3M1_MASK                      equ 0002h
CCP3CON_CCP3M2_POSN                      equ 0002h
CCP3CON_CCP3M2_POSITION                  equ 0002h
CCP3CON_CCP3M2_SIZE                      equ 0001h
CCP3CON_CCP3M2_LENGTH                    equ 0001h
CCP3CON_CCP3M2_MASK                      equ 0004h
CCP3CON_CCP3M3_POSN                      equ 0003h
CCP3CON_CCP3M3_POSITION                  equ 0003h
CCP3CON_CCP3M3_SIZE                      equ 0001h
CCP3CON_CCP3M3_LENGTH                    equ 0001h
CCP3CON_CCP3M3_MASK                      equ 0008h
CCP3CON_DC3B0_POSN                       equ 0004h
CCP3CON_DC3B0_POSITION                   equ 0004h
CCP3CON_DC3B0_SIZE                       equ 0001h
CCP3CON_DC3B0_LENGTH                     equ 0001h
CCP3CON_DC3B0_MASK                       equ 0010h
CCP3CON_DC3B1_POSN                       equ 0005h
CCP3CON_DC3B1_POSITION                   equ 0005h
CCP3CON_DC3B1_SIZE                       equ 0001h
CCP3CON_DC3B1_LENGTH                     equ 0001h
CCP3CON_DC3B1_MASK                       equ 0020h

