GopalSaraf/Practicals/PSDL/include/proc/pic16lf1789.inc
// Register: CLKRCON
#define CLKRCON CLKRCON
CLKRCON                                  equ 051Ah
// bitfield definitions
CLKRCON_CLKRDIV0_POSN                    equ 0000h
CLKRCON_CLKRDIV0_POSITION                equ 0000h
CLKRCON_CLKRDIV0_SIZE                    equ 0001h
CLKRCON_CLKRDIV0_LENGTH                  equ 0001h
CLKRCON_CLKRDIV0_MASK                    equ 0001h
CLKRCON_CLKRDIV1_POSN                    equ 0001h
CLKRCON_CLKRDIV1_POSITION                equ 0001h
CLKRCON_CLKRDIV1_SIZE                    equ 0001h
CLKRCON_CLKRDIV1_LENGTH                  equ 0001h
CLKRCON_CLKRDIV1_MASK                    equ 0002h
CLKRCON_CLKRDIV2_POSN                    equ 0002h
CLKRCON_CLKRDIV2_POSITION                equ 0002h
CLKRCON_CLKRDIV2_SIZE                    equ 0001h
CLKRCON_CLKRDIV2_LENGTH                  equ 0001h
CLKRCON_CLKRDIV2_MASK                    equ 0004h
CLKRCON_CLKRDC0_POSN                     equ 0003h
CLKRCON_CLKRDC0_POSITION                 equ 0003h
CLKRCON_CLKRDC0_SIZE                     equ 0001h
CLKRCON_CLKRDC0_LENGTH                   equ 0001h
CLKRCON_CLKRDC0_MASK                     equ 0008h
CLKRCON_CLKRDC1_POSN                     equ 0004h
CLKRCON_CLKRDC1_POSITION                 equ 0004h
CLKRCON_CLKRDC1_SIZE                     equ 0001h
CLKRCON_CLKRDC1_LENGTH                   equ 0001h
CLKRCON_CLKRDC1_MASK                     equ 0010h
CLKRCON_CLKRSLR_POSN                     equ 0005h
CLKRCON_CLKRSLR_POSITION                 equ 0005h
CLKRCON_CLKRSLR_SIZE                     equ 0001h
CLKRCON_CLKRSLR_LENGTH                   equ 0001h
CLKRCON_CLKRSLR_MASK                     equ 0020h
CLKRCON_CLKROE_POSN                      equ 0006h
CLKRCON_CLKROE_POSITION                  equ 0006h
CLKRCON_CLKROE_SIZE                      equ 0001h
CLKRCON_CLKROE_LENGTH                    equ 0001h
CLKRCON_CLKROE_MASK                      equ 0040h
CLKRCON_CLKREN_POSN                      equ 0007h
CLKRCON_CLKREN_POSITION                  equ 0007h
CLKRCON_CLKREN_SIZE                      equ 0001h
CLKRCON_CLKREN_LENGTH                    equ 0001h
CLKRCON_CLKREN_MASK                      equ 0080h
CLKRCON_CLKRDIV_POSN                     equ 0000h
CLKRCON_CLKRDIV_POSITION                 equ 0000h
CLKRCON_CLKRDIV_SIZE                     equ 0003h
CLKRCON_CLKRDIV_LENGTH                   equ 0003h
CLKRCON_CLKRDIV_MASK                     equ 0007h
CLKRCON_CLKRDC_POSN                      equ 0003h
CLKRCON_CLKRDC_POSITION                  equ 0003h
CLKRCON_CLKRDC_SIZE                      equ 0002h
CLKRCON_CLKRDC_LENGTH                    equ 0002h
CLKRCON_CLKRDC_MASK                      equ 0018h

// Register: DAC2CON0
#define DAC2CON0 DAC2CON0
DAC2CON0                                 equ 0591h
// bitfield definitions
DAC2CON0_DAC2PSS_POSN                    equ 0002h
DAC2CON0_DAC2PSS_POSITION                equ 0002h
DAC2CON0_DAC2PSS_SIZE                    equ 0002h
DAC2CON0_DAC2PSS_LENGTH                  equ 0002h
DAC2CON0_DAC2PSS_MASK                    equ 000Ch
DAC2CON0_DAC2OE2_POSN                    equ 0004h
DAC2CON0_DAC2OE2_POSITION                equ 0004h
DAC2CON0_DAC2OE2_SIZE                    equ 0001h
DAC2CON0_DAC2OE2_LENGTH                  equ 0001h
DAC2CON0_DAC2OE2_MASK                    equ 0010h
DAC2CON0_DAC2OE1_POSN                    equ 0005h
DAC2CON0_DAC2OE1_POSITION                equ 0005h
DAC2CON0_DAC2OE1_SIZE                    equ 0001h
DAC2CON0_DAC2OE1_LENGTH                  equ 0001h
DAC2CON0_DAC2OE1_MASK                    equ 0020h
DAC2CON0_DAC2EN_POSN                     equ 0007h
DAC2CON0_DAC2EN_POSITION                 equ 0007h
DAC2CON0_DAC2EN_SIZE                     equ 0001h
DAC2CON0_DAC2EN_LENGTH                   equ 0001h
DAC2CON0_DAC2EN_MASK                     equ 0080h

// Register: DAC2REF
#define DAC2REF DAC2REF
DAC2REF                                  equ 0592h
// bitfield definitions
DAC2REF_DAC2R_POSN                       equ 0000h
DAC2REF_DAC2R_POSITION                   equ 0000h
DAC2REF_DAC2R_SIZE                       equ 0005h
DAC2REF_DAC2R_LENGTH                     equ 0005h
DAC2REF_DAC2R_MASK                       equ 001Fh

// Register: DAC3CON0
#define DAC3CON0 DAC3CON0
DAC3CON0                                 equ 0593h
// bitfield definitions
DAC3CON0_DAC3PSS_POSN                    equ 0002h
DAC3CON0_DAC3PSS_POSITION                equ 0002h
DAC3CON0_DAC3PSS_SIZE                    equ 0002h
DAC3CON0_DAC3PSS_LENGTH                  equ 0002h
DAC3CON0_DAC3PSS_MASK                    equ 000Ch
DAC3CON0_DAC3OE2_POSN                    equ 0004h
DAC3CON0_DAC3OE2_POSITION                equ 0004h
DAC3CON0_DAC3OE2_SIZE                    equ 0001h
DAC3CON0_DAC3OE2_LENGTH                  equ 0001h
DAC3CON0_DAC3OE2_MASK                    equ 0010h
DAC3CON0_DAC3OE1_POSN                    equ 0005h
DAC3CON0_DAC3OE1_POSITION                equ 0005h
DAC3CON0_DAC3OE1_SIZE                    equ 0001h
DAC3CON0_DAC3OE1_LENGTH                  equ 0001h
DAC3CON0_DAC3OE1_MASK                    equ 0020h
DAC3CON0_DAC3EN_POSN                     equ 0007h
DAC3CON0_DAC3EN_POSITION                 equ 0007h
DAC3CON0_DAC3EN_SIZE                     equ 0001h
DAC3CON0_DAC3EN_LENGTH                   equ 0001h
DAC3CON0_DAC3EN_MASK                     equ 0080h

// Register: DAC3REF
#define DAC3REF DAC3REF
DAC3REF                                  equ 0594h
// bitfield definitions
DAC3REF_DAC3R_POSN                       equ 0000h
DAC3REF_DAC3R_POSITION                   equ 0000h
DAC3REF_DAC3R_SIZE                       equ 0005h
DAC3REF_DAC3R_LENGTH                     equ 0005h
DAC3REF_DAC3R_MASK                       equ 001Fh

// Register: DAC4CON0
#define DAC4CON0 DAC4CON0
DAC4CON0                                 equ 0595h
// bitfield definitions
DAC4CON0_DAC4PSS_POSN                    equ 0002h
DAC4CON0_DAC4PSS_POSITION                equ 0002h
DAC4CON0_DAC4PSS_SIZE                    equ 0002h
DAC4CON0_DAC4PSS_LENGTH                  equ 0002h
DAC4CON0_DAC4PSS_MASK                    equ 000Ch
DAC4CON0_DAC4OE2_POSN                    equ 0004h
DAC4CON0_DAC4OE2_POSITION                equ 0004h
DAC4CON0_DAC4OE2_SIZE                    equ 0001h
DAC4CON0_DAC4OE2_LENGTH                  equ 0001h
DAC4CON0_DAC4OE2_MASK                    equ 0010h
DAC4CON0_DAC4OE1_POSN                    equ 0005h
DAC4CON0_DAC4OE1_POSITION                equ 0005h
DAC4CON0_DAC4OE1_SIZE                    equ 0001h
DAC4CON0_DAC4OE1_LENGTH                  equ 0001h
DAC4CON0_DAC4OE1_MASK                    equ 0020h
DAC4CON0_DAC4EN_POSN                     equ 0007h
DAC4CON0_DAC4EN_POSITION                 equ 0007h
DAC4CON0_DAC4EN_SIZE                     equ 0001h
DAC4CON0_DAC4EN_LENGTH                   equ 0001h
DAC4CON0_DAC4EN_MASK                     equ 0080h

// Register: DAC4REF
#define DAC4REF DAC4REF
DAC4REF                                  equ 0596h
// bitfield definitions
DAC4REF_DAC4R_POSN                       equ 0000h
DAC4REF_DAC4R_POSITION                   equ 0000h
DAC4REF_DAC4R_SIZE                       equ 0005h
DAC4REF_DAC4R_LENGTH                     equ 0005h
DAC4REF_DAC4R_MASK                       equ 001Fh

// Register: PSMC1CON
#define PSMC1CON PSMC1CON
PSMC1CON                                 equ 0E91h
// bitfield definitions
PSMC1CON_P1MODE_POSN                     equ 0000h
PSMC1CON_P1MODE_POSITION                 equ 0000h
PSMC1CON_P1MODE_SIZE                     equ 0004h
PSMC1CON_P1MODE_LENGTH                   equ 0004h
PSMC1CON_P1MODE_MASK                     equ 000Fh
PSMC1CON_P1DBRE_POSN                     equ 0004h
PSMC1CON_P1DBRE_POSITION                 equ 0004h
PSMC1CON_P1DBRE_SIZE                     equ 0001h
PSMC1CON_P1DBRE_LENGTH                   equ 0001h
PSMC1CON_P1DBRE_MASK                     equ 0010h
PSMC1CON_P1DBFE_POSN                     equ 0005h
PSMC1CON_P1DBFE_POSITION                 equ 0005h
PSMC1CON_P1DBFE_SIZE                     equ 0001h
PSMC1CON_P1DBFE_LENGTH                   equ 0001h
PSMC1CON_P1DBFE_MASK                     equ 0020h
PSMC1CON_PSMC1LD_POSN                    equ 0006h
PSMC1CON_PSMC1LD_POSITION                equ 0006h
PSMC1CON_PSMC1LD_SIZE                    equ 0001h
PSMC1CON_PSMC1LD_LENGTH                  equ 0001h
PSMC1CON_PSMC1LD_MASK                    equ 0040h
PSMC1CON_PSMC1EN_POSN                    equ 0007h
PSMC1CON_PSMC1EN_POSITION                equ 0007h
PSMC1CON_PSMC1EN_SIZE                    equ 0001h
PSMC1CON_PSMC1EN_LENGTH                  equ 0001h
PSMC1CON_PSMC1EN_MASK                    equ 0080h
PSMC1CON_P1MODE0_POSN                    equ 0000h
PSMC1CON_P1MODE0_POSITION                equ 0000h
PSMC1CON_P1MODE0_SIZE                    equ 0001h
PSMC1CON_P1MODE0_LENGTH                  equ 0001h
PSMC1CON_P1MODE0_MASK                    equ 0001h
PSMC1CON_P1MODE1_POSN                    equ 0001h
PSMC1CON_P1MODE1_POSITION                equ 0001h
PSMC1CON_P1MODE1_SIZE                    equ 0001h
PSMC1CON_P1MODE1_LENGTH                  equ 0001h
PSMC1CON_P1MODE1_MASK                    equ 0002h
PSMC1CON_P1MODE2_POSN                    equ 0002h
PSMC1CON_P1MODE2_POSITION                equ 0002h
PSMC1CON_P1MODE2_SIZE                    equ 0001h
PSMC1CON_P1MODE2_LENGTH                  equ 0001h
PSMC1CON_P1MODE2_MASK                    equ 0004h
PSMC1CON_P1MODE3_POSN                    equ 0003h
PSMC1CON_P1MODE3_POSITION                equ 0003h
PSMC1CON_P1MODE3_SIZE                    equ 0001h
PSMC1CON_P1MODE3_LENGTH                  equ 0001h
PSMC1CON_P1MODE3_MASK                    equ 0008h

// Register: PSMC1MDL
#define PSMC1MDL PSMC1MDL
PSMC1MDL                                 equ 0E92h
// bitfield definitions
PSMC1MDL_P1MSRC_POSN                     equ 0000h
PSMC1MDL_P1MSRC_POSITION                 equ 0000h
PSMC1MDL_P1MSRC_SIZE                     equ 0004h
PSMC1MDL_P1MSRC_LENGTH                   equ 0004h
PSMC1MDL_P1MSRC_MASK                     equ 000Fh
PSMC1MDL_P1MDLBIT_POSN                   equ 0005h
PSMC1MDL_P1MDLBIT_POSITION               equ 0005h
PSMC1MDL_P1MDLBIT_SIZE                   equ 0001h
PSMC1MDL_P1MDLBIT_LENGTH                 equ 0001h
PSMC1MDL_P1MDLBIT_MASK                   equ 0020h
PSMC1MDL_P1MDLPOL_POSN                   equ 0006h
PSMC1MDL_P1MDLPOL_POSITION               equ 0006h
PSMC1MDL_P1MDLPOL_SIZE                   equ 0001h
PSMC1MDL_P1MDLPOL_LENGTH                 equ 0001h
PSMC1MDL_P1MDLPOL_MASK                   equ 0040h
PSMC1MDL_P1MDLEN_POSN                    equ 0007h
PSMC1MDL_P1MDLEN_POSITION                equ 0007h
PSMC1MDL_P1MDLEN_SIZE                    equ 0001h
PSMC1MDL_P1MDLEN_LENGTH                  equ 0001h
PSMC1MDL_P1MDLEN_MASK                    equ 0080h
PSMC1MDL_P1MSRC0_POSN                    equ 0000h
PSMC1MDL_P1MSRC0_POSITION                equ 0000h
PSMC1MDL_P1MSRC0_SIZE                    equ 0001h
PSMC1MDL_P1MSRC0_LENGTH                  equ 0001h
PSMC1MDL_P1MSRC0_MASK                    equ 0001h
PSMC1MDL_P1MSRC1_POSN                    equ 0001h
PSMC1MDL_P1MSRC1_POSITION                equ 0001h
PSMC1MDL_P1MSRC1_SIZE                    equ 0001h
PSMC1MDL_P1MSRC1_LENGTH                  equ 0001h
PSMC1MDL_P1MSRC1_MASK                    equ 0002h
PSMC1MDL_P1MSRC2_POSN                    equ 0002h
PSMC1MDL_P1MSRC2_POSITION                equ 0002h
PSMC1MDL_P1MSRC2_SIZE                    equ 0001h
PSMC1MDL_P1MSRC2_LENGTH                  equ 0001h
PSMC1MDL_P1MSRC2_MASK                    equ 0004h
PSMC1MDL_P1MSRC3_POSN                    equ 0003h
PSMC1MDL_P1MSRC3_POSITION                equ 0003h
PSMC1MDL_P1MSRC3_SIZE                    equ 0001h
PSMC1MDL_P1MSRC3_LENGTH                  equ 0001h
PSMC1MDL_P1MSRC3_MASK                    equ 0008h

// Register: PSMC1SYNC
#define PSMC1SYNC PSMC1SYNC
PSMC1SYNC                                equ 0E93h
// bitfield definitions
PSMC1SYNC_P1SYNC0_POSN                   equ 0000h
PSMC1SYNC_P1SYNC0_POSITION               equ 0000h
PSMC1SYNC_P1SYNC0_SIZE                   equ 0001h
PSMC1SYNC_P1SYNC0_LENGTH                 equ 0001h
PSMC1SYNC_P1SYNC0_MASK                   equ 0001h
PSMC1SYNC_P1SYNC1_POSN                   equ 0001h
PSMC1SYNC_P1SYNC1_POSITION               equ 0001h
PSMC1SYNC_P1SYNC1_SIZE                   equ 0001h
PSMC1SYNC_P1SYNC1_LENGTH                 equ 0001h
PSMC1SYNC_P1SYNC1_MASK                   equ 0002h
PSMC1SYNC_P1SYNC2_POSN                   equ 0002h
PSMC1SYNC_P1SYNC2_POSITION               equ 0002h
PSMC1SYNC_P1SYNC2_SIZE                   equ 0001h
PSMC1SYNC_P1SYNC2_LENGTH                 equ 0001h
PSMC1SYNC_P1SYNC2_MASK                   equ 0004h
PSMC1SYNC_P1DCPOL_POSN                   equ 0005h
PSMC1SYNC_P1DCPOL_POSITION               equ 0005h
PSMC1SYNC_P1DCPOL_SIZE                   equ 0001h
PSMC1SYNC_P1DCPOL_LENGTH                 equ 0001h
PSMC1SYNC_P1DCPOL_MASK                   equ 0020h
PSMC1SYNC_P1PRPOL_POSN                   equ 0006h
PSMC1SYNC_P1PRPOL_POSITION               equ 0006h
PSMC1SYNC_P1PRPOL_SIZE                   equ 0001h
PSMC1SYNC_P1PRPOL_LENGTH                 equ 0001h
PSMC1SYNC_P1PRPOL_MASK                   equ 0040h
PSMC1SYNC_P1POFST_POSN                   equ 0007h
PSMC1SYNC_P1POFST_POSITION               equ 0007h
PSMC1SYNC_P1POFST_SIZE                   equ 0001h
PSMC1SYNC_P1POFST_LENGTH                 equ 0001h
PSMC1SYNC_P1POFST_MASK                   equ 0080h

// Register: PSMC1CLK
#define PSMC1CLK PSMC1CLK
PSMC1CLK                                 equ 0E94h
// bitfield definitions
PSMC1CLK_P1CSRC0_POSN                    equ 0000h
PSMC1CLK_P1CSRC0_POSITION                equ 0000h
PSMC1CLK_P1CSRC0_SIZE                    equ 0001h
PSMC1CLK_P1CSRC0_LENGTH                  equ 0001h
PSMC1CLK_P1CSRC0_MASK                    equ 0001h
PSMC1CLK_P1CSRC1_POSN                    equ 0001h
PSMC1CLK_P1CSRC1_POSITION                equ 0001h
PSMC1CLK_P1CSRC1_SIZE                    equ 0001h
PSMC1CLK_P1CSRC1_LENGTH                  equ 0001h
PSMC1CLK_P1CSRC1_MASK                    equ 0002h
PSMC1CLK_P1CPRE0_POSN                    equ 0004h
PSMC1CLK_P1CPRE0_POSITION                equ 0004h
PSMC1CLK_P1CPRE0_SIZE                    equ 0001h
PSMC1CLK_P1CPRE0_LENGTH                  equ 0001h
PSMC1CLK_P1CPRE0_MASK                    equ 0010h
PSMC1CLK_P1CPRE1_POSN                    equ 0005h
PSMC1CLK_P1CPRE1_POSITION                equ 0005h
PSMC1CLK_P1CPRE1_SIZE                    equ 0001h
PSMC1CLK_P1CPRE1_LENGTH                  equ 0001h
PSMC1CLK_P1CPRE1_MASK                    equ 0020h
PSMC1CLK_P1CSRC_POSN                     equ 0000h
PSMC1CLK_P1CSRC_POSITION                 equ 0000h
PSMC1CLK_P1CSRC_SIZE                     equ 0002h
PSMC1CLK_P1CSRC_LENGTH                   equ 0002h
PSMC1CLK_P1CSRC_MASK                     equ 0003h
PSMC1CLK_P1CPRE_POSN                     equ 0004h
PSMC1CLK_P1CPRE_POSITION                 equ 0004h
PSMC1CLK_P1CPRE_SIZE                     equ 0002h
PSMC1CLK_P1CPRE_LENGTH                   equ 0002h
PSMC1CLK_P1CPRE_MASK                     equ 0030h

// Register: PSMC1OEN
#define PSMC1OEN PSMC1OEN
PSMC1OEN                                 equ 0E95h
// bitfield definitions
PSMC1OEN_P1OEA_POSN                      equ 0000h
PSMC1OEN_P1OEA_POSITION                  equ 0000h
PSMC1OEN_P1OEA_SIZE                      equ 0001h
PSMC1OEN_P1OEA_LENGTH                    equ 0001h
PSMC1OEN_P1OEA_MASK                      equ 0001h
PSMC1OEN_P1OEB_POSN                      equ 0001h
PSMC1OEN_P1OEB_POSITION                  equ 0001h
PSMC1OEN_P1OEB_SIZE                      equ 0001h
PSMC1OEN_P1OEB_LENGTH                    equ 0001h
PSMC1OEN_P1OEB_MASK                      equ 0002h
PSMC1OEN_P1OEC_POSN                      equ 0002h
PSMC1OEN_P1OEC_POSITION                  equ 0002h
PSMC1OEN_P1OEC_SIZE                      equ 0001h
PSMC1OEN_P1OEC_LENGTH                    equ 0001h
PSMC1OEN_P1OEC_MASK                      equ 0004h
PSMC1OEN_P1OED_POSN                      equ 0003h
PSMC1OEN_P1OED_POSITION                  equ 0003h
PSMC1OEN_P1OED_SIZE                      equ 0001h
PSMC1OEN_P1OED_LENGTH                    equ 0001h
PSMC1OEN_P1OED_MASK                      equ 0008h
PSMC1OEN_P1OEE_POSN                      equ 0004h
PSMC1OEN_P1OEE_POSITION                  equ 0004h
PSMC1OEN_P1OEE_SIZE                      equ 0001h
PSMC1OEN_P1OEE_LENGTH                    equ 0001h
PSMC1OEN_P1OEE_MASK                      equ 0010h
PSMC1OEN_P1OEF_POSN                      equ 0005h
PSMC1OEN_P1OEF_POSITION                  equ 0005h
PSMC1OEN_P1OEF_SIZE                      equ 0001h
PSMC1OEN_P1OEF_LENGTH                    equ 0001h
PSMC1OEN_P1OEF_MASK                      equ 0020h

// Register: PSMC1POL
#define PSMC1POL PSMC1POL
PSMC1POL                                 equ 0E96h
// bitfield definitions
PSMC1POL_P1POLA_POSN                     equ 0000h
PSMC1POL_P1POLA_POSITION                 equ 0000h
PSMC1POL_P1POLA_SIZE                     equ 0001h
PSMC1POL_P1POLA_LENGTH                   equ 0001h
PSMC1POL_P1POLA_MASK                     equ 0001h
PSMC1POL_P1POLB_POSN                     equ 0001h
PSMC1POL_P1POLB_POSITION                 equ 0001h
PSMC1POL_P1POLB_SIZE                     equ 0001h
PSMC1POL_P1POLB_LENGTH                   equ 0001h
PSMC1POL_P1POLB_MASK                     equ 0002h
PSMC1POL_P1POLC_POSN                     equ 0002h
PSMC1POL_P1POLC_POSITION                 equ 0002h
PSMC1POL_P1POLC_SIZE                     equ 0001h
PSMC1POL_P1POLC_LENGTH                   equ 0001h
PSMC1POL_P1POLC_MASK                     equ 0004h
PSMC1POL_P1POLD_POSN                     equ 0003h
PSMC1POL_P1POLD_POSITION                 equ 0003h
PSMC1POL_P1POLD_SIZE                     equ 0001h
PSMC1POL_P1POLD_LENGTH                   equ 0001h
PSMC1POL_P1POLD_MASK                     equ 0008h
PSMC1POL_P1POLE_POSN                     equ 0004h
PSMC1POL_P1POLE_POSITION                 equ 0004h
PSMC1POL_P1POLE_SIZE                     equ 0001h
PSMC1POL_P1POLE_LENGTH                   equ 0001h
PSMC1POL_P1POLE_MASK                     equ 0010h
PSMC1POL_P1POLF_POSN                     equ 0005h
PSMC1POL_P1POLF_POSITION                 equ 0005h
PSMC1POL_P1POLF_SIZE                     equ 0001h
PSMC1POL_P1POLF_LENGTH                   equ 0001h
PSMC1POL_P1POLF_MASK                     equ 0020h
PSMC1POL_P1INPOL_POSN                    equ 0006h
PSMC1POL_P1INPOL_POSITION                equ 0006h
PSMC1POL_P1INPOL_SIZE                    equ 0001h
PSMC1POL_P1INPOL_LENGTH                  equ 0001h
PSMC1POL_P1INPOL_MASK                    equ 0040h

