GopalSaraf/Practicals/PSDL/include/proc/pic16lf1789.inc
// Register: PSMC3BLKF
#define PSMC3BLKF PSMC3BLKF
PSMC3BLKF                                equ 0EECh
// bitfield definitions
PSMC3BLKF_PSMC3BLKF0_POSN                equ 0000h
PSMC3BLKF_PSMC3BLKF0_POSITION            equ 0000h
PSMC3BLKF_PSMC3BLKF0_SIZE                equ 0001h
PSMC3BLKF_PSMC3BLKF0_LENGTH              equ 0001h
PSMC3BLKF_PSMC3BLKF0_MASK                equ 0001h
PSMC3BLKF_PSMC3BLKF1_POSN                equ 0001h
PSMC3BLKF_PSMC3BLKF1_POSITION            equ 0001h
PSMC3BLKF_PSMC3BLKF1_SIZE                equ 0001h
PSMC3BLKF_PSMC3BLKF1_LENGTH              equ 0001h
PSMC3BLKF_PSMC3BLKF1_MASK                equ 0002h
PSMC3BLKF_PSMC3BLKF2_POSN                equ 0002h
PSMC3BLKF_PSMC3BLKF2_POSITION            equ 0002h
PSMC3BLKF_PSMC3BLKF2_SIZE                equ 0001h
PSMC3BLKF_PSMC3BLKF2_LENGTH              equ 0001h
PSMC3BLKF_PSMC3BLKF2_MASK                equ 0004h
PSMC3BLKF_PSMC3BLKF3_POSN                equ 0003h
PSMC3BLKF_PSMC3BLKF3_POSITION            equ 0003h
PSMC3BLKF_PSMC3BLKF3_SIZE                equ 0001h
PSMC3BLKF_PSMC3BLKF3_LENGTH              equ 0001h
PSMC3BLKF_PSMC3BLKF3_MASK                equ 0008h
PSMC3BLKF_PSMC3BLKF4_POSN                equ 0004h
PSMC3BLKF_PSMC3BLKF4_POSITION            equ 0004h
PSMC3BLKF_PSMC3BLKF4_SIZE                equ 0001h
PSMC3BLKF_PSMC3BLKF4_LENGTH              equ 0001h
PSMC3BLKF_PSMC3BLKF4_MASK                equ 0010h
PSMC3BLKF_PSMC3BLKF5_POSN                equ 0005h
PSMC3BLKF_PSMC3BLKF5_POSITION            equ 0005h
PSMC3BLKF_PSMC3BLKF5_SIZE                equ 0001h
PSMC3BLKF_PSMC3BLKF5_LENGTH              equ 0001h
PSMC3BLKF_PSMC3BLKF5_MASK                equ 0020h
PSMC3BLKF_PSMC3BLKF6_POSN                equ 0006h
PSMC3BLKF_PSMC3BLKF6_POSITION            equ 0006h
PSMC3BLKF_PSMC3BLKF6_SIZE                equ 0001h
PSMC3BLKF_PSMC3BLKF6_LENGTH              equ 0001h
PSMC3BLKF_PSMC3BLKF6_MASK                equ 0040h
PSMC3BLKF_PSMC3BLKF7_POSN                equ 0007h
PSMC3BLKF_PSMC3BLKF7_POSITION            equ 0007h
PSMC3BLKF_PSMC3BLKF7_SIZE                equ 0001h
PSMC3BLKF_PSMC3BLKF7_LENGTH              equ 0001h
PSMC3BLKF_PSMC3BLKF7_MASK                equ 0080h

// Register: PSMC3FFA
#define PSMC3FFA PSMC3FFA
PSMC3FFA                                 equ 0EEDh
// bitfield definitions
PSMC3FFA_PSMC3FFA0_POSN                  equ 0000h
PSMC3FFA_PSMC3FFA0_POSITION              equ 0000h
PSMC3FFA_PSMC3FFA0_SIZE                  equ 0001h
PSMC3FFA_PSMC3FFA0_LENGTH                equ 0001h
PSMC3FFA_PSMC3FFA0_MASK                  equ 0001h
PSMC3FFA_PSMC3FFA1_POSN                  equ 0001h
PSMC3FFA_PSMC3FFA1_POSITION              equ 0001h
PSMC3FFA_PSMC3FFA1_SIZE                  equ 0001h
PSMC3FFA_PSMC3FFA1_LENGTH                equ 0001h
PSMC3FFA_PSMC3FFA1_MASK                  equ 0002h
PSMC3FFA_PSMC3FFA2_POSN                  equ 0002h
PSMC3FFA_PSMC3FFA2_POSITION              equ 0002h
PSMC3FFA_PSMC3FFA2_SIZE                  equ 0001h
PSMC3FFA_PSMC3FFA2_LENGTH                equ 0001h
PSMC3FFA_PSMC3FFA2_MASK                  equ 0004h
PSMC3FFA_PSMC3FFA3_POSN                  equ 0003h
PSMC3FFA_PSMC3FFA3_POSITION              equ 0003h
PSMC3FFA_PSMC3FFA3_SIZE                  equ 0001h
PSMC3FFA_PSMC3FFA3_LENGTH                equ 0001h
PSMC3FFA_PSMC3FFA3_MASK                  equ 0008h

// Register: PSMC3STR0
#define PSMC3STR0 PSMC3STR0
PSMC3STR0                                equ 0EEEh
// bitfield definitions
PSMC3STR0_P3STRA_POSN                    equ 0000h
PSMC3STR0_P3STRA_POSITION                equ 0000h
PSMC3STR0_P3STRA_SIZE                    equ 0001h
PSMC3STR0_P3STRA_LENGTH                  equ 0001h
PSMC3STR0_P3STRA_MASK                    equ 0001h
PSMC3STR0_P3STRB_POSN                    equ 0001h
PSMC3STR0_P3STRB_POSITION                equ 0001h
PSMC3STR0_P3STRB_SIZE                    equ 0001h
PSMC3STR0_P3STRB_LENGTH                  equ 0001h
PSMC3STR0_P3STRB_MASK                    equ 0002h
PSMC3STR0_P3STRC_POSN                    equ 0002h
PSMC3STR0_P3STRC_POSITION                equ 0002h
PSMC3STR0_P3STRC_SIZE                    equ 0001h
PSMC3STR0_P3STRC_LENGTH                  equ 0001h
PSMC3STR0_P3STRC_MASK                    equ 0004h
PSMC3STR0_P3STRD_POSN                    equ 0003h
PSMC3STR0_P3STRD_POSITION                equ 0003h
PSMC3STR0_P3STRD_SIZE                    equ 0001h
PSMC3STR0_P3STRD_LENGTH                  equ 0001h
PSMC3STR0_P3STRD_MASK                    equ 0008h
PSMC3STR0_P3STRE_POSN                    equ 0004h
PSMC3STR0_P3STRE_POSITION                equ 0004h
PSMC3STR0_P3STRE_SIZE                    equ 0001h
PSMC3STR0_P3STRE_LENGTH                  equ 0001h
PSMC3STR0_P3STRE_MASK                    equ 0010h
PSMC3STR0_P3STRF_POSN                    equ 0005h
PSMC3STR0_P3STRF_POSITION                equ 0005h
PSMC3STR0_P3STRF_SIZE                    equ 0001h
PSMC3STR0_P3STRF_LENGTH                  equ 0001h
PSMC3STR0_P3STRF_MASK                    equ 0020h

// Register: PSMC3STR1
#define PSMC3STR1 PSMC3STR1
PSMC3STR1                                equ 0EEFh
// bitfield definitions
PSMC3STR1_P3HSMEN_POSN                   equ 0000h
PSMC3STR1_P3HSMEN_POSITION               equ 0000h
PSMC3STR1_P3HSMEN_SIZE                   equ 0001h
PSMC3STR1_P3HSMEN_LENGTH                 equ 0001h
PSMC3STR1_P3HSMEN_MASK                   equ 0001h
PSMC3STR1_P3LSMEN_POSN                   equ 0001h
PSMC3STR1_P3LSMEN_POSITION               equ 0001h
PSMC3STR1_P3LSMEN_SIZE                   equ 0001h
PSMC3STR1_P3LSMEN_LENGTH                 equ 0001h
PSMC3STR1_P3LSMEN_MASK                   equ 0002h
PSMC3STR1_P3SSYNC_POSN                   equ 0007h
PSMC3STR1_P3SSYNC_POSITION               equ 0007h
PSMC3STR1_P3SSYNC_SIZE                   equ 0001h
PSMC3STR1_P3SSYNC_LENGTH                 equ 0001h
PSMC3STR1_P3SSYNC_MASK                   equ 0080h

// Register: PSMC4CON
#define PSMC4CON PSMC4CON
PSMC4CON                                 equ 0F11h
// bitfield definitions
PSMC4CON_P4MODE_POSN                     equ 0000h
PSMC4CON_P4MODE_POSITION                 equ 0000h
PSMC4CON_P4MODE_SIZE                     equ 0004h
PSMC4CON_P4MODE_LENGTH                   equ 0004h
PSMC4CON_P4MODE_MASK                     equ 000Fh
PSMC4CON_P4DBRE_POSN                     equ 0004h
PSMC4CON_P4DBRE_POSITION                 equ 0004h
PSMC4CON_P4DBRE_SIZE                     equ 0001h
PSMC4CON_P4DBRE_LENGTH                   equ 0001h
PSMC4CON_P4DBRE_MASK                     equ 0010h
PSMC4CON_P4DBFE_POSN                     equ 0005h
PSMC4CON_P4DBFE_POSITION                 equ 0005h
PSMC4CON_P4DBFE_SIZE                     equ 0001h
PSMC4CON_P4DBFE_LENGTH                   equ 0001h
PSMC4CON_P4DBFE_MASK                     equ 0020h
PSMC4CON_PSMC4LD_POSN                    equ 0006h
PSMC4CON_PSMC4LD_POSITION                equ 0006h
PSMC4CON_PSMC4LD_SIZE                    equ 0001h
PSMC4CON_PSMC4LD_LENGTH                  equ 0001h
PSMC4CON_PSMC4LD_MASK                    equ 0040h
PSMC4CON_PSMC4EN_POSN                    equ 0007h
PSMC4CON_PSMC4EN_POSITION                equ 0007h
PSMC4CON_PSMC4EN_SIZE                    equ 0001h
PSMC4CON_PSMC4EN_LENGTH                  equ 0001h
PSMC4CON_PSMC4EN_MASK                    equ 0080h
PSMC4CON_P4MODE0_POSN                    equ 0000h
PSMC4CON_P4MODE0_POSITION                equ 0000h
PSMC4CON_P4MODE0_SIZE                    equ 0001h
PSMC4CON_P4MODE0_LENGTH                  equ 0001h
PSMC4CON_P4MODE0_MASK                    equ 0001h
PSMC4CON_P4MODE1_POSN                    equ 0001h
PSMC4CON_P4MODE1_POSITION                equ 0001h
PSMC4CON_P4MODE1_SIZE                    equ 0001h
PSMC4CON_P4MODE1_LENGTH                  equ 0001h
PSMC4CON_P4MODE1_MASK                    equ 0002h
PSMC4CON_P4MODE2_POSN                    equ 0002h
PSMC4CON_P4MODE2_POSITION                equ 0002h
PSMC4CON_P4MODE2_SIZE                    equ 0001h
PSMC4CON_P4MODE2_LENGTH                  equ 0001h
PSMC4CON_P4MODE2_MASK                    equ 0004h
PSMC4CON_P4MODE3_POSN                    equ 0003h
PSMC4CON_P4MODE3_POSITION                equ 0003h
PSMC4CON_P4MODE3_SIZE                    equ 0001h
PSMC4CON_P4MODE3_LENGTH                  equ 0001h
PSMC4CON_P4MODE3_MASK                    equ 0008h

