GopalSaraf/Practicals/PSDL/include/proc/pic16lf1789.inc
// Register: PSMC4INT
#define PSMC4INT PSMC4INT
PSMC4INT                                 equ 0F20h
// bitfield definitions
PSMC4INT_P4TPRIF_POSN                    equ 0000h
PSMC4INT_P4TPRIF_POSITION                equ 0000h
PSMC4INT_P4TPRIF_SIZE                    equ 0001h
PSMC4INT_P4TPRIF_LENGTH                  equ 0001h
PSMC4INT_P4TPRIF_MASK                    equ 0001h
PSMC4INT_P4TDCIF_POSN                    equ 0001h
PSMC4INT_P4TDCIF_POSITION                equ 0001h
PSMC4INT_P4TDCIF_SIZE                    equ 0001h
PSMC4INT_P4TDCIF_LENGTH                  equ 0001h
PSMC4INT_P4TDCIF_MASK                    equ 0002h
PSMC4INT_P4TPHIF_POSN                    equ 0002h
PSMC4INT_P4TPHIF_POSITION                equ 0002h
PSMC4INT_P4TPHIF_SIZE                    equ 0001h
PSMC4INT_P4TPHIF_LENGTH                  equ 0001h
PSMC4INT_P4TPHIF_MASK                    equ 0004h
PSMC4INT_P4TOVIF_POSN                    equ 0003h
PSMC4INT_P4TOVIF_POSITION                equ 0003h
PSMC4INT_P4TOVIF_SIZE                    equ 0001h
PSMC4INT_P4TOVIF_LENGTH                  equ 0001h
PSMC4INT_P4TOVIF_MASK                    equ 0008h
PSMC4INT_P4TPRIE_POSN                    equ 0004h
PSMC4INT_P4TPRIE_POSITION                equ 0004h
PSMC4INT_P4TPRIE_SIZE                    equ 0001h
PSMC4INT_P4TPRIE_LENGTH                  equ 0001h
PSMC4INT_P4TPRIE_MASK                    equ 0010h
PSMC4INT_P4TDCIE_POSN                    equ 0005h
PSMC4INT_P4TDCIE_POSITION                equ 0005h
PSMC4INT_P4TDCIE_SIZE                    equ 0001h
PSMC4INT_P4TDCIE_LENGTH                  equ 0001h
PSMC4INT_P4TDCIE_MASK                    equ 0020h
PSMC4INT_P4TPHIE_POSN                    equ 0006h
PSMC4INT_P4TPHIE_POSITION                equ 0006h
PSMC4INT_P4TPHIE_SIZE                    equ 0001h
PSMC4INT_P4TPHIE_LENGTH                  equ 0001h
PSMC4INT_P4TPHIE_MASK                    equ 0040h
PSMC4INT_P4TOVIE_POSN                    equ 0007h
PSMC4INT_P4TOVIE_POSITION                equ 0007h
PSMC4INT_P4TOVIE_SIZE                    equ 0001h
PSMC4INT_P4TOVIE_LENGTH                  equ 0001h
PSMC4INT_P4TOVIE_MASK                    equ 0080h

// Register: PSMC4PHL
#define PSMC4PHL PSMC4PHL
PSMC4PHL                                 equ 0F21h
// bitfield definitions
PSMC4PHL_PSMC4PH0_POSN                   equ 0000h
PSMC4PHL_PSMC4PH0_POSITION               equ 0000h
PSMC4PHL_PSMC4PH0_SIZE                   equ 0001h
PSMC4PHL_PSMC4PH0_LENGTH                 equ 0001h
PSMC4PHL_PSMC4PH0_MASK                   equ 0001h
PSMC4PHL_PSMC4PH1_POSN                   equ 0001h
PSMC4PHL_PSMC4PH1_POSITION               equ 0001h
PSMC4PHL_PSMC4PH1_SIZE                   equ 0001h
PSMC4PHL_PSMC4PH1_LENGTH                 equ 0001h
PSMC4PHL_PSMC4PH1_MASK                   equ 0002h
PSMC4PHL_PSMC4PH2_POSN                   equ 0002h
PSMC4PHL_PSMC4PH2_POSITION               equ 0002h
PSMC4PHL_PSMC4PH2_SIZE                   equ 0001h
PSMC4PHL_PSMC4PH2_LENGTH                 equ 0001h
PSMC4PHL_PSMC4PH2_MASK                   equ 0004h
PSMC4PHL_PSMC4PH3_POSN                   equ 0003h
PSMC4PHL_PSMC4PH3_POSITION               equ 0003h
PSMC4PHL_PSMC4PH3_SIZE                   equ 0001h
PSMC4PHL_PSMC4PH3_LENGTH                 equ 0001h
PSMC4PHL_PSMC4PH3_MASK                   equ 0008h
PSMC4PHL_PSMC4PH4_POSN                   equ 0004h
PSMC4PHL_PSMC4PH4_POSITION               equ 0004h
PSMC4PHL_PSMC4PH4_SIZE                   equ 0001h
PSMC4PHL_PSMC4PH4_LENGTH                 equ 0001h
PSMC4PHL_PSMC4PH4_MASK                   equ 0010h
PSMC4PHL_PSMC4PH5_POSN                   equ 0005h
PSMC4PHL_PSMC4PH5_POSITION               equ 0005h
PSMC4PHL_PSMC4PH5_SIZE                   equ 0001h
PSMC4PHL_PSMC4PH5_LENGTH                 equ 0001h
PSMC4PHL_PSMC4PH5_MASK                   equ 0020h
PSMC4PHL_PSMC4PH6_POSN                   equ 0006h
PSMC4PHL_PSMC4PH6_POSITION               equ 0006h
PSMC4PHL_PSMC4PH6_SIZE                   equ 0001h
PSMC4PHL_PSMC4PH6_LENGTH                 equ 0001h
PSMC4PHL_PSMC4PH6_MASK                   equ 0040h
PSMC4PHL_PSMC4PH7_POSN                   equ 0007h
PSMC4PHL_PSMC4PH7_POSITION               equ 0007h
PSMC4PHL_PSMC4PH7_SIZE                   equ 0001h
PSMC4PHL_PSMC4PH7_LENGTH                 equ 0001h
PSMC4PHL_PSMC4PH7_MASK                   equ 0080h

// Register: PSMC4PHH
#define PSMC4PHH PSMC4PHH
PSMC4PHH                                 equ 0F22h
// bitfield definitions
PSMC4PHH_PSMC4PH8_POSN                   equ 0000h
PSMC4PHH_PSMC4PH8_POSITION               equ 0000h
PSMC4PHH_PSMC4PH8_SIZE                   equ 0001h
PSMC4PHH_PSMC4PH8_LENGTH                 equ 0001h
PSMC4PHH_PSMC4PH8_MASK                   equ 0001h
PSMC4PHH_PSMC4PH9_POSN                   equ 0001h
PSMC4PHH_PSMC4PH9_POSITION               equ 0001h
PSMC4PHH_PSMC4PH9_SIZE                   equ 0001h
PSMC4PHH_PSMC4PH9_LENGTH                 equ 0001h
PSMC4PHH_PSMC4PH9_MASK                   equ 0002h
PSMC4PHH_PSMC4PH10_POSN                  equ 0002h
PSMC4PHH_PSMC4PH10_POSITION              equ 0002h
PSMC4PHH_PSMC4PH10_SIZE                  equ 0001h
PSMC4PHH_PSMC4PH10_LENGTH                equ 0001h
PSMC4PHH_PSMC4PH10_MASK                  equ 0004h
PSMC4PHH_PSMC4PH11_POSN                  equ 0003h
PSMC4PHH_PSMC4PH11_POSITION              equ 0003h
PSMC4PHH_PSMC4PH11_SIZE                  equ 0001h
PSMC4PHH_PSMC4PH11_LENGTH                equ 0001h
PSMC4PHH_PSMC4PH11_MASK                  equ 0008h
PSMC4PHH_PSMC4PH12_POSN                  equ 0004h
PSMC4PHH_PSMC4PH12_POSITION              equ 0004h
PSMC4PHH_PSMC4PH12_SIZE                  equ 0001h
PSMC4PHH_PSMC4PH12_LENGTH                equ 0001h
PSMC4PHH_PSMC4PH12_MASK                  equ 0010h
PSMC4PHH_PSMC4PH13_POSN                  equ 0005h
PSMC4PHH_PSMC4PH13_POSITION              equ 0005h
PSMC4PHH_PSMC4PH13_SIZE                  equ 0001h
PSMC4PHH_PSMC4PH13_LENGTH                equ 0001h
PSMC4PHH_PSMC4PH13_MASK                  equ 0020h
PSMC4PHH_PSMC4PH14_POSN                  equ 0006h
PSMC4PHH_PSMC4PH14_POSITION              equ 0006h
PSMC4PHH_PSMC4PH14_SIZE                  equ 0001h
PSMC4PHH_PSMC4PH14_LENGTH                equ 0001h
PSMC4PHH_PSMC4PH14_MASK                  equ 0040h
PSMC4PHH_PSMC4PH15_POSN                  equ 0007h
PSMC4PHH_PSMC4PH15_POSITION              equ 0007h
PSMC4PHH_PSMC4PH15_SIZE                  equ 0001h
PSMC4PHH_PSMC4PH15_LENGTH                equ 0001h
PSMC4PHH_PSMC4PH15_MASK                  equ 0080h

