GopalSaraf/Practicals/PSDL/include/proc/pic16lf1789.inc
// Register: PSMC4DCL
#define PSMC4DCL PSMC4DCL
PSMC4DCL                                 equ 0F23h
// bitfield definitions
PSMC4DCL_PSMC4DC0_POSN                   equ 0000h
PSMC4DCL_PSMC4DC0_POSITION               equ 0000h
PSMC4DCL_PSMC4DC0_SIZE                   equ 0001h
PSMC4DCL_PSMC4DC0_LENGTH                 equ 0001h
PSMC4DCL_PSMC4DC0_MASK                   equ 0001h
PSMC4DCL_PSMC4DC1_POSN                   equ 0001h
PSMC4DCL_PSMC4DC1_POSITION               equ 0001h
PSMC4DCL_PSMC4DC1_SIZE                   equ 0001h
PSMC4DCL_PSMC4DC1_LENGTH                 equ 0001h
PSMC4DCL_PSMC4DC1_MASK                   equ 0002h
PSMC4DCL_PSMC4DC2_POSN                   equ 0002h
PSMC4DCL_PSMC4DC2_POSITION               equ 0002h
PSMC4DCL_PSMC4DC2_SIZE                   equ 0001h
PSMC4DCL_PSMC4DC2_LENGTH                 equ 0001h
PSMC4DCL_PSMC4DC2_MASK                   equ 0004h
PSMC4DCL_PSMC4DC3_POSN                   equ 0003h
PSMC4DCL_PSMC4DC3_POSITION               equ 0003h
PSMC4DCL_PSMC4DC3_SIZE                   equ 0001h
PSMC4DCL_PSMC4DC3_LENGTH                 equ 0001h
PSMC4DCL_PSMC4DC3_MASK                   equ 0008h
PSMC4DCL_PSMC4DC4_POSN                   equ 0004h
PSMC4DCL_PSMC4DC4_POSITION               equ 0004h
PSMC4DCL_PSMC4DC4_SIZE                   equ 0001h
PSMC4DCL_PSMC4DC4_LENGTH                 equ 0001h
PSMC4DCL_PSMC4DC4_MASK                   equ 0010h
PSMC4DCL_PSMC4DC5_POSN                   equ 0005h
PSMC4DCL_PSMC4DC5_POSITION               equ 0005h
PSMC4DCL_PSMC4DC5_SIZE                   equ 0001h
PSMC4DCL_PSMC4DC5_LENGTH                 equ 0001h
PSMC4DCL_PSMC4DC5_MASK                   equ 0020h
PSMC4DCL_PSMC4DC6_POSN                   equ 0006h
PSMC4DCL_PSMC4DC6_POSITION               equ 0006h
PSMC4DCL_PSMC4DC6_SIZE                   equ 0001h
PSMC4DCL_PSMC4DC6_LENGTH                 equ 0001h
PSMC4DCL_PSMC4DC6_MASK                   equ 0040h
PSMC4DCL_PSMC4DC7_POSN                   equ 0007h
PSMC4DCL_PSMC4DC7_POSITION               equ 0007h
PSMC4DCL_PSMC4DC7_SIZE                   equ 0001h
PSMC4DCL_PSMC4DC7_LENGTH                 equ 0001h
PSMC4DCL_PSMC4DC7_MASK                   equ 0080h

// Register: PSMC4DCH
#define PSMC4DCH PSMC4DCH
PSMC4DCH                                 equ 0F24h
// bitfield definitions
PSMC4DCH_PSMC4DC8_POSN                   equ 0000h
PSMC4DCH_PSMC4DC8_POSITION               equ 0000h
PSMC4DCH_PSMC4DC8_SIZE                   equ 0001h
PSMC4DCH_PSMC4DC8_LENGTH                 equ 0001h
PSMC4DCH_PSMC4DC8_MASK                   equ 0001h
PSMC4DCH_PSMC4DC9_POSN                   equ 0001h
PSMC4DCH_PSMC4DC9_POSITION               equ 0001h
PSMC4DCH_PSMC4DC9_SIZE                   equ 0001h
PSMC4DCH_PSMC4DC9_LENGTH                 equ 0001h
PSMC4DCH_PSMC4DC9_MASK                   equ 0002h
PSMC4DCH_PSMC4DC10_POSN                  equ 0002h
PSMC4DCH_PSMC4DC10_POSITION              equ 0002h
PSMC4DCH_PSMC4DC10_SIZE                  equ 0001h
PSMC4DCH_PSMC4DC10_LENGTH                equ 0001h
PSMC4DCH_PSMC4DC10_MASK                  equ 0004h
PSMC4DCH_PSMC4DC11_POSN                  equ 0003h
PSMC4DCH_PSMC4DC11_POSITION              equ 0003h
PSMC4DCH_PSMC4DC11_SIZE                  equ 0001h
PSMC4DCH_PSMC4DC11_LENGTH                equ 0001h
PSMC4DCH_PSMC4DC11_MASK                  equ 0008h
PSMC4DCH_PSMC4DC12_POSN                  equ 0004h
PSMC4DCH_PSMC4DC12_POSITION              equ 0004h
PSMC4DCH_PSMC4DC12_SIZE                  equ 0001h
PSMC4DCH_PSMC4DC12_LENGTH                equ 0001h
PSMC4DCH_PSMC4DC12_MASK                  equ 0010h
PSMC4DCH_PSMC4DC13_POSN                  equ 0005h
PSMC4DCH_PSMC4DC13_POSITION              equ 0005h
PSMC4DCH_PSMC4DC13_SIZE                  equ 0001h
PSMC4DCH_PSMC4DC13_LENGTH                equ 0001h
PSMC4DCH_PSMC4DC13_MASK                  equ 0020h
PSMC4DCH_PSMC4DC14_POSN                  equ 0006h
PSMC4DCH_PSMC4DC14_POSITION              equ 0006h
PSMC4DCH_PSMC4DC14_SIZE                  equ 0001h
PSMC4DCH_PSMC4DC14_LENGTH                equ 0001h
PSMC4DCH_PSMC4DC14_MASK                  equ 0040h
PSMC4DCH_PSMC4DC15_POSN                  equ 0007h
PSMC4DCH_PSMC4DC15_POSITION              equ 0007h
PSMC4DCH_PSMC4DC15_SIZE                  equ 0001h
PSMC4DCH_PSMC4DC15_LENGTH                equ 0001h
PSMC4DCH_PSMC4DC15_MASK                  equ 0080h

// Register: PSMC4PRL
#define PSMC4PRL PSMC4PRL
PSMC4PRL                                 equ 0F25h
// bitfield definitions
PSMC4PRL_PSMC4PR0_POSN                   equ 0000h
PSMC4PRL_PSMC4PR0_POSITION               equ 0000h
PSMC4PRL_PSMC4PR0_SIZE                   equ 0001h
PSMC4PRL_PSMC4PR0_LENGTH                 equ 0001h
PSMC4PRL_PSMC4PR0_MASK                   equ 0001h
PSMC4PRL_PSMC4PR1_POSN                   equ 0001h
PSMC4PRL_PSMC4PR1_POSITION               equ 0001h
PSMC4PRL_PSMC4PR1_SIZE                   equ 0001h
PSMC4PRL_PSMC4PR1_LENGTH                 equ 0001h
PSMC4PRL_PSMC4PR1_MASK                   equ 0002h
PSMC4PRL_PSMC4PR2_POSN                   equ 0002h
PSMC4PRL_PSMC4PR2_POSITION               equ 0002h
PSMC4PRL_PSMC4PR2_SIZE                   equ 0001h
PSMC4PRL_PSMC4PR2_LENGTH                 equ 0001h
PSMC4PRL_PSMC4PR2_MASK                   equ 0004h
PSMC4PRL_PSMC4PR3_POSN                   equ 0003h
PSMC4PRL_PSMC4PR3_POSITION               equ 0003h
PSMC4PRL_PSMC4PR3_SIZE                   equ 0001h
PSMC4PRL_PSMC4PR3_LENGTH                 equ 0001h
PSMC4PRL_PSMC4PR3_MASK                   equ 0008h
PSMC4PRL_PSMC4PR4_POSN                   equ 0004h
PSMC4PRL_PSMC4PR4_POSITION               equ 0004h
PSMC4PRL_PSMC4PR4_SIZE                   equ 0001h
PSMC4PRL_PSMC4PR4_LENGTH                 equ 0001h
PSMC4PRL_PSMC4PR4_MASK                   equ 0010h
PSMC4PRL_PSMC4PR5_POSN                   equ 0005h
PSMC4PRL_PSMC4PR5_POSITION               equ 0005h
PSMC4PRL_PSMC4PR5_SIZE                   equ 0001h
PSMC4PRL_PSMC4PR5_LENGTH                 equ 0001h
PSMC4PRL_PSMC4PR5_MASK                   equ 0020h
PSMC4PRL_PSMC4PR6_POSN                   equ 0006h
PSMC4PRL_PSMC4PR6_POSITION               equ 0006h
PSMC4PRL_PSMC4PR6_SIZE                   equ 0001h
PSMC4PRL_PSMC4PR6_LENGTH                 equ 0001h
PSMC4PRL_PSMC4PR6_MASK                   equ 0040h
PSMC4PRL_PSMC4PR7_POSN                   equ 0007h
PSMC4PRL_PSMC4PR7_POSITION               equ 0007h
PSMC4PRL_PSMC4PR7_SIZE                   equ 0001h
PSMC4PRL_PSMC4PR7_LENGTH                 equ 0001h
PSMC4PRL_PSMC4PR7_MASK                   equ 0080h

// Register: PSMC4PRH
#define PSMC4PRH PSMC4PRH
PSMC4PRH                                 equ 0F26h
// bitfield definitions
PSMC4PRH_PSMC4PR8_POSN                   equ 0000h
PSMC4PRH_PSMC4PR8_POSITION               equ 0000h
PSMC4PRH_PSMC4PR8_SIZE                   equ 0001h
PSMC4PRH_PSMC4PR8_LENGTH                 equ 0001h
PSMC4PRH_PSMC4PR8_MASK                   equ 0001h
PSMC4PRH_PSMC4PR9_POSN                   equ 0001h
PSMC4PRH_PSMC4PR9_POSITION               equ 0001h
PSMC4PRH_PSMC4PR9_SIZE                   equ 0001h
PSMC4PRH_PSMC4PR9_LENGTH                 equ 0001h
PSMC4PRH_PSMC4PR9_MASK                   equ 0002h
PSMC4PRH_PSMC4PR10_POSN                  equ 0002h
PSMC4PRH_PSMC4PR10_POSITION              equ 0002h
PSMC4PRH_PSMC4PR10_SIZE                  equ 0001h
PSMC4PRH_PSMC4PR10_LENGTH                equ 0001h
PSMC4PRH_PSMC4PR10_MASK                  equ 0004h
PSMC4PRH_PSMC4PR11_POSN                  equ 0003h
PSMC4PRH_PSMC4PR11_POSITION              equ 0003h
PSMC4PRH_PSMC4PR11_SIZE                  equ 0001h
PSMC4PRH_PSMC4PR11_LENGTH                equ 0001h
PSMC4PRH_PSMC4PR11_MASK                  equ 0008h
PSMC4PRH_PSMC4PR12_POSN                  equ 0004h
PSMC4PRH_PSMC4PR12_POSITION              equ 0004h
PSMC4PRH_PSMC4PR12_SIZE                  equ 0001h
PSMC4PRH_PSMC4PR12_LENGTH                equ 0001h
PSMC4PRH_PSMC4PR12_MASK                  equ 0010h
PSMC4PRH_PSMC4PR13_POSN                  equ 0005h
PSMC4PRH_PSMC4PR13_POSITION              equ 0005h
PSMC4PRH_PSMC4PR13_SIZE                  equ 0001h
PSMC4PRH_PSMC4PR13_LENGTH                equ 0001h
PSMC4PRH_PSMC4PR13_MASK                  equ 0020h
PSMC4PRH_PSMC4PR14_POSN                  equ 0006h
PSMC4PRH_PSMC4PR14_POSITION              equ 0006h
PSMC4PRH_PSMC4PR14_SIZE                  equ 0001h
PSMC4PRH_PSMC4PR14_LENGTH                equ 0001h
PSMC4PRH_PSMC4PR14_MASK                  equ 0040h
PSMC4PRH_PSMC4PR15_POSN                  equ 0007h
PSMC4PRH_PSMC4PR15_POSITION              equ 0007h
PSMC4PRH_PSMC4PR15_SIZE                  equ 0001h
PSMC4PRH_PSMC4PR15_LENGTH                equ 0001h
PSMC4PRH_PSMC4PR15_MASK                  equ 0080h

// Register: PSMC4TMRL
#define PSMC4TMRL PSMC4TMRL
PSMC4TMRL                                equ 0F27h
// bitfield definitions
PSMC4TMRL_PSMC4TMR0_POSN                 equ 0000h
PSMC4TMRL_PSMC4TMR0_POSITION             equ 0000h
PSMC4TMRL_PSMC4TMR0_SIZE                 equ 0001h
PSMC4TMRL_PSMC4TMR0_LENGTH               equ 0001h
PSMC4TMRL_PSMC4TMR0_MASK                 equ 0001h
PSMC4TMRL_PSMC4TMR1_POSN                 equ 0001h
PSMC4TMRL_PSMC4TMR1_POSITION             equ 0001h
PSMC4TMRL_PSMC4TMR1_SIZE                 equ 0001h
PSMC4TMRL_PSMC4TMR1_LENGTH               equ 0001h
PSMC4TMRL_PSMC4TMR1_MASK                 equ 0002h
PSMC4TMRL_PSMC4TMR2_POSN                 equ 0002h
PSMC4TMRL_PSMC4TMR2_POSITION             equ 0002h
PSMC4TMRL_PSMC4TMR2_SIZE                 equ 0001h
PSMC4TMRL_PSMC4TMR2_LENGTH               equ 0001h
PSMC4TMRL_PSMC4TMR2_MASK                 equ 0004h
PSMC4TMRL_PSMC4TMR3_POSN                 equ 0003h
PSMC4TMRL_PSMC4TMR3_POSITION             equ 0003h
PSMC4TMRL_PSMC4TMR3_SIZE                 equ 0001h
PSMC4TMRL_PSMC4TMR3_LENGTH               equ 0001h
PSMC4TMRL_PSMC4TMR3_MASK                 equ 0008h
PSMC4TMRL_PSMC4TMR4_POSN                 equ 0004h
PSMC4TMRL_PSMC4TMR4_POSITION             equ 0004h
PSMC4TMRL_PSMC4TMR4_SIZE                 equ 0001h
PSMC4TMRL_PSMC4TMR4_LENGTH               equ 0001h
PSMC4TMRL_PSMC4TMR4_MASK                 equ 0010h
PSMC4TMRL_PSMC4TMR5_POSN                 equ 0005h
PSMC4TMRL_PSMC4TMR5_POSITION             equ 0005h
PSMC4TMRL_PSMC4TMR5_SIZE                 equ 0001h
PSMC4TMRL_PSMC4TMR5_LENGTH               equ 0001h
PSMC4TMRL_PSMC4TMR5_MASK                 equ 0020h
PSMC4TMRL_PSMC4TMR6_POSN                 equ 0006h
PSMC4TMRL_PSMC4TMR6_POSITION             equ 0006h
PSMC4TMRL_PSMC4TMR6_SIZE                 equ 0001h
PSMC4TMRL_PSMC4TMR6_LENGTH               equ 0001h
PSMC4TMRL_PSMC4TMR6_MASK                 equ 0040h
PSMC4TMRL_PSMC4TMR7_POSN                 equ 0007h
PSMC4TMRL_PSMC4TMR7_POSITION             equ 0007h
PSMC4TMRL_PSMC4TMR7_SIZE                 equ 0001h
PSMC4TMRL_PSMC4TMR7_LENGTH               equ 0001h
PSMC4TMRL_PSMC4TMR7_MASK                 equ 0080h

// Register: PSMC4TMRH
#define PSMC4TMRH PSMC4TMRH
PSMC4TMRH                                equ 0F28h
// bitfield definitions
PSMC4TMRH_PSMC4TMR8_POSN                 equ 0000h
PSMC4TMRH_PSMC4TMR8_POSITION             equ 0000h
PSMC4TMRH_PSMC4TMR8_SIZE                 equ 0001h
PSMC4TMRH_PSMC4TMR8_LENGTH               equ 0001h
PSMC4TMRH_PSMC4TMR8_MASK                 equ 0001h
PSMC4TMRH_PSMC4TMR9_POSN                 equ 0001h
PSMC4TMRH_PSMC4TMR9_POSITION             equ 0001h
PSMC4TMRH_PSMC4TMR9_SIZE                 equ 0001h
PSMC4TMRH_PSMC4TMR9_LENGTH               equ 0001h
PSMC4TMRH_PSMC4TMR9_MASK                 equ 0002h
PSMC4TMRH_PSMC4TMR10_POSN                equ 0002h
PSMC4TMRH_PSMC4TMR10_POSITION            equ 0002h
PSMC4TMRH_PSMC4TMR10_SIZE                equ 0001h
PSMC4TMRH_PSMC4TMR10_LENGTH              equ 0001h
PSMC4TMRH_PSMC4TMR10_MASK                equ 0004h
PSMC4TMRH_PSMC4TMR11_POSN                equ 0003h
PSMC4TMRH_PSMC4TMR11_POSITION            equ 0003h
PSMC4TMRH_PSMC4TMR11_SIZE                equ 0001h
PSMC4TMRH_PSMC4TMR11_LENGTH              equ 0001h
PSMC4TMRH_PSMC4TMR11_MASK                equ 0008h
PSMC4TMRH_PSMC4TMR12_POSN                equ 0004h
PSMC4TMRH_PSMC4TMR12_POSITION            equ 0004h
PSMC4TMRH_PSMC4TMR12_SIZE                equ 0001h
PSMC4TMRH_PSMC4TMR12_LENGTH              equ 0001h
PSMC4TMRH_PSMC4TMR12_MASK                equ 0010h
PSMC4TMRH_PSMC4TMR13_POSN                equ 0005h
PSMC4TMRH_PSMC4TMR13_POSITION            equ 0005h
PSMC4TMRH_PSMC4TMR13_SIZE                equ 0001h
PSMC4TMRH_PSMC4TMR13_LENGTH              equ 0001h
PSMC4TMRH_PSMC4TMR13_MASK                equ 0020h
PSMC4TMRH_PSMC4TMR14_POSN                equ 0006h
PSMC4TMRH_PSMC4TMR14_POSITION            equ 0006h
PSMC4TMRH_PSMC4TMR14_SIZE                equ 0001h
PSMC4TMRH_PSMC4TMR14_LENGTH              equ 0001h
PSMC4TMRH_PSMC4TMR14_MASK                equ 0040h
PSMC4TMRH_PSMC4TMR15_POSN                equ 0007h
PSMC4TMRH_PSMC4TMR15_POSITION            equ 0007h
PSMC4TMRH_PSMC4TMR15_SIZE                equ 0001h
PSMC4TMRH_PSMC4TMR15_LENGTH              equ 0001h
PSMC4TMRH_PSMC4TMR15_MASK                equ 0080h

// Register: PSMC4DBR
#define PSMC4DBR PSMC4DBR
PSMC4DBR                                 equ 0F29h
// bitfield definitions
PSMC4DBR_PSMC4DBR0_POSN                  equ 0000h
PSMC4DBR_PSMC4DBR0_POSITION              equ 0000h
PSMC4DBR_PSMC4DBR0_SIZE                  equ 0001h
PSMC4DBR_PSMC4DBR0_LENGTH                equ 0001h
PSMC4DBR_PSMC4DBR0_MASK                  equ 0001h
PSMC4DBR_PSMC4DBR1_POSN                  equ 0001h
PSMC4DBR_PSMC4DBR1_POSITION              equ 0001h
PSMC4DBR_PSMC4DBR1_SIZE                  equ 0001h
PSMC4DBR_PSMC4DBR1_LENGTH                equ 0001h
PSMC4DBR_PSMC4DBR1_MASK                  equ 0002h
PSMC4DBR_PSMC4DBR2_POSN                  equ 0002h
PSMC4DBR_PSMC4DBR2_POSITION              equ 0002h
PSMC4DBR_PSMC4DBR2_SIZE                  equ 0001h
PSMC4DBR_PSMC4DBR2_LENGTH                equ 0001h
PSMC4DBR_PSMC4DBR2_MASK                  equ 0004h
PSMC4DBR_PSMC4DBR3_POSN                  equ 0003h
PSMC4DBR_PSMC4DBR3_POSITION              equ 0003h
PSMC4DBR_PSMC4DBR3_SIZE                  equ 0001h
PSMC4DBR_PSMC4DBR3_LENGTH                equ 0001h
PSMC4DBR_PSMC4DBR3_MASK                  equ 0008h
PSMC4DBR_PSMC4DBR4_POSN                  equ 0004h
PSMC4DBR_PSMC4DBR4_POSITION              equ 0004h
PSMC4DBR_PSMC4DBR4_SIZE                  equ 0001h
PSMC4DBR_PSMC4DBR4_LENGTH                equ 0001h
PSMC4DBR_PSMC4DBR4_MASK                  equ 0010h
PSMC4DBR_PSMC4DBR5_POSN                  equ 0005h
PSMC4DBR_PSMC4DBR5_POSITION              equ 0005h
PSMC4DBR_PSMC4DBR5_SIZE                  equ 0001h
PSMC4DBR_PSMC4DBR5_LENGTH                equ 0001h
PSMC4DBR_PSMC4DBR5_MASK                  equ 0020h
PSMC4DBR_PSMC4DBR6_POSN                  equ 0006h
PSMC4DBR_PSMC4DBR6_POSITION              equ 0006h
PSMC4DBR_PSMC4DBR6_SIZE                  equ 0001h
PSMC4DBR_PSMC4DBR6_LENGTH                equ 0001h
PSMC4DBR_PSMC4DBR6_MASK                  equ 0040h
PSMC4DBR_PSMC4DBR7_POSN                  equ 0007h
PSMC4DBR_PSMC4DBR7_POSITION              equ 0007h
PSMC4DBR_PSMC4DBR7_SIZE                  equ 0001h
PSMC4DBR_PSMC4DBR7_LENGTH                equ 0001h
PSMC4DBR_PSMC4DBR7_MASK                  equ 0080h

// Register: PSMC4DBF
#define PSMC4DBF PSMC4DBF
PSMC4DBF                                 equ 0F2Ah
// bitfield definitions
PSMC4DBF_PSMC4DBF0_POSN                  equ 0000h
PSMC4DBF_PSMC4DBF0_POSITION              equ 0000h
PSMC4DBF_PSMC4DBF0_SIZE                  equ 0001h
PSMC4DBF_PSMC4DBF0_LENGTH                equ 0001h
PSMC4DBF_PSMC4DBF0_MASK                  equ 0001h
PSMC4DBF_PSMC4DBF1_POSN                  equ 0001h
PSMC4DBF_PSMC4DBF1_POSITION              equ 0001h
PSMC4DBF_PSMC4DBF1_SIZE                  equ 0001h
PSMC4DBF_PSMC4DBF1_LENGTH                equ 0001h
PSMC4DBF_PSMC4DBF1_MASK                  equ 0002h
PSMC4DBF_PSMC4DBF2_POSN                  equ 0002h
PSMC4DBF_PSMC4DBF2_POSITION              equ 0002h
PSMC4DBF_PSMC4DBF2_SIZE                  equ 0001h
PSMC4DBF_PSMC4DBF2_LENGTH                equ 0001h
PSMC4DBF_PSMC4DBF2_MASK                  equ 0004h
PSMC4DBF_PSMC4DBF3_POSN                  equ 0003h
PSMC4DBF_PSMC4DBF3_POSITION              equ 0003h
PSMC4DBF_PSMC4DBF3_SIZE                  equ 0001h
PSMC4DBF_PSMC4DBF3_LENGTH                equ 0001h
PSMC4DBF_PSMC4DBF3_MASK                  equ 0008h
PSMC4DBF_PSMC4DBF4_POSN                  equ 0004h
PSMC4DBF_PSMC4DBF4_POSITION              equ 0004h
PSMC4DBF_PSMC4DBF4_SIZE                  equ 0001h
PSMC4DBF_PSMC4DBF4_LENGTH                equ 0001h
PSMC4DBF_PSMC4DBF4_MASK                  equ 0010h
PSMC4DBF_PSMC4DBF5_POSN                  equ 0005h
PSMC4DBF_PSMC4DBF5_POSITION              equ 0005h
PSMC4DBF_PSMC4DBF5_SIZE                  equ 0001h
PSMC4DBF_PSMC4DBF5_LENGTH                equ 0001h
PSMC4DBF_PSMC4DBF5_MASK                  equ 0020h
PSMC4DBF_PSMC4DBF6_POSN                  equ 0006h
PSMC4DBF_PSMC4DBF6_POSITION              equ 0006h
PSMC4DBF_PSMC4DBF6_SIZE                  equ 0001h
PSMC4DBF_PSMC4DBF6_LENGTH                equ 0001h
PSMC4DBF_PSMC4DBF6_MASK                  equ 0040h
PSMC4DBF_PSMC4DBF7_POSN                  equ 0007h
PSMC4DBF_PSMC4DBF7_POSITION              equ 0007h
PSMC4DBF_PSMC4DBF7_SIZE                  equ 0001h
PSMC4DBF_PSMC4DBF7_LENGTH                equ 0001h
PSMC4DBF_PSMC4DBF7_MASK                  equ 0080h

// Register: PSMC4BLKR
#define PSMC4BLKR PSMC4BLKR
PSMC4BLKR                                equ 0F2Bh
// bitfield definitions
PSMC4BLKR_PSMC4BLKR0_POSN                equ 0000h
PSMC4BLKR_PSMC4BLKR0_POSITION            equ 0000h
PSMC4BLKR_PSMC4BLKR0_SIZE                equ 0001h
PSMC4BLKR_PSMC4BLKR0_LENGTH              equ 0001h
PSMC4BLKR_PSMC4BLKR0_MASK                equ 0001h
PSMC4BLKR_PSMC4BLKR1_POSN                equ 0001h
PSMC4BLKR_PSMC4BLKR1_POSITION            equ 0001h
PSMC4BLKR_PSMC4BLKR1_SIZE                equ 0001h
PSMC4BLKR_PSMC4BLKR1_LENGTH              equ 0001h
PSMC4BLKR_PSMC4BLKR1_MASK                equ 0002h
PSMC4BLKR_PSMC4BLKR2_POSN                equ 0002h
PSMC4BLKR_PSMC4BLKR2_POSITION            equ 0002h
PSMC4BLKR_PSMC4BLKR2_SIZE                equ 0001h
PSMC4BLKR_PSMC4BLKR2_LENGTH              equ 0001h
PSMC4BLKR_PSMC4BLKR2_MASK                equ 0004h
PSMC4BLKR_PSMC4BLKR3_POSN                equ 0003h
PSMC4BLKR_PSMC4BLKR3_POSITION            equ 0003h
PSMC4BLKR_PSMC4BLKR3_SIZE                equ 0001h
PSMC4BLKR_PSMC4BLKR3_LENGTH              equ 0001h
PSMC4BLKR_PSMC4BLKR3_MASK                equ 0008h
PSMC4BLKR_PSMC4BLKR4_POSN                equ 0004h
PSMC4BLKR_PSMC4BLKR4_POSITION            equ 0004h
PSMC4BLKR_PSMC4BLKR4_SIZE                equ 0001h
PSMC4BLKR_PSMC4BLKR4_LENGTH              equ 0001h
PSMC4BLKR_PSMC4BLKR4_MASK                equ 0010h
PSMC4BLKR_PSMC4BLKR5_POSN                equ 0005h
PSMC4BLKR_PSMC4BLKR5_POSITION            equ 0005h
PSMC4BLKR_PSMC4BLKR5_SIZE                equ 0001h
PSMC4BLKR_PSMC4BLKR5_LENGTH              equ 0001h
PSMC4BLKR_PSMC4BLKR5_MASK                equ 0020h
PSMC4BLKR_PSMC4BLKR6_POSN                equ 0006h
PSMC4BLKR_PSMC4BLKR6_POSITION            equ 0006h
PSMC4BLKR_PSMC4BLKR6_SIZE                equ 0001h
PSMC4BLKR_PSMC4BLKR6_LENGTH              equ 0001h
PSMC4BLKR_PSMC4BLKR6_MASK                equ 0040h
PSMC4BLKR_PSMC4BLKR7_POSN                equ 0007h
PSMC4BLKR_PSMC4BLKR7_POSITION            equ 0007h
PSMC4BLKR_PSMC4BLKR7_SIZE                equ 0001h
PSMC4BLKR_PSMC4BLKR7_LENGTH              equ 0001h
PSMC4BLKR_PSMC4BLKR7_MASK                equ 0080h

