GopalSaraf/Practicals/PSDL/include/proc/pic16lf1789.inc
#define PSMC3PH5                         BANKMASK(PSMC3PHL), 5
#define PSMC3PH6                         BANKMASK(PSMC3PHL), 6
#define PSMC3PH7                         BANKMASK(PSMC3PHL), 7
#define PSMC3PH8                         BANKMASK(PSMC3PHH), 0
#define PSMC3PH9                         BANKMASK(PSMC3PHH), 1
#define PSMC3PR0                         BANKMASK(PSMC3PRL), 0
#define PSMC3PR1                         BANKMASK(PSMC3PRL), 1
#define PSMC3PR10                        BANKMASK(PSMC3PRH), 2
#define PSMC3PR11                        BANKMASK(PSMC3PRH), 3
#define PSMC3PR12                        BANKMASK(PSMC3PRH), 4
#define PSMC3PR13                        BANKMASK(PSMC3PRH), 5
#define PSMC3PR14                        BANKMASK(PSMC3PRH), 6
#define PSMC3PR15                        BANKMASK(PSMC3PRH), 7
#define PSMC3PR2                         BANKMASK(PSMC3PRL), 2
#define PSMC3PR3                         BANKMASK(PSMC3PRL), 3
#define PSMC3PR4                         BANKMASK(PSMC3PRL), 4
#define PSMC3PR5                         BANKMASK(PSMC3PRL), 5
#define PSMC3PR6                         BANKMASK(PSMC3PRL), 6
#define PSMC3PR7                         BANKMASK(PSMC3PRL), 7
#define PSMC3PR8                         BANKMASK(PSMC3PRH), 0
#define PSMC3PR9                         BANKMASK(PSMC3PRH), 1
#define PSMC3SIE                         BANKMASK(PIE4), 2
#define PSMC3SIF                         BANKMASK(PIR4), 2
#define PSMC3TIE                         BANKMASK(PIE4), 6
#define PSMC3TIF                         BANKMASK(PIR4), 6
#define PSMC3TMR0                        BANKMASK(PSMC3TMRL), 0
#define PSMC3TMR1                        BANKMASK(PSMC3TMRL), 1
#define PSMC3TMR10                       BANKMASK(PSMC3TMRH), 2
#define PSMC3TMR11                       BANKMASK(PSMC3TMRH), 3
#define PSMC3TMR12                       BANKMASK(PSMC3TMRH), 4
#define PSMC3TMR13                       BANKMASK(PSMC3TMRH), 5
#define PSMC3TMR14                       BANKMASK(PSMC3TMRH), 6
#define PSMC3TMR15                       BANKMASK(PSMC3TMRH), 7
#define PSMC3TMR2                        BANKMASK(PSMC3TMRL), 2
#define PSMC3TMR3                        BANKMASK(PSMC3TMRL), 3
#define PSMC3TMR4                        BANKMASK(PSMC3TMRL), 4
#define PSMC3TMR5                        BANKMASK(PSMC3TMRL), 5
#define PSMC3TMR6                        BANKMASK(PSMC3TMRL), 6
#define PSMC3TMR7                        BANKMASK(PSMC3TMRL), 7
#define PSMC3TMR8                        BANKMASK(PSMC3TMRH), 0
#define PSMC3TMR9                        BANKMASK(PSMC3TMRH), 1
#define PSMC4BLKF0                       BANKMASK(PSMC4BLKF), 0
#define PSMC4BLKF1                       BANKMASK(PSMC4BLKF), 1
#define PSMC4BLKF2                       BANKMASK(PSMC4BLKF), 2
#define PSMC4BLKF3                       BANKMASK(PSMC4BLKF), 3
#define PSMC4BLKF4                       BANKMASK(PSMC4BLKF), 4
#define PSMC4BLKF5                       BANKMASK(PSMC4BLKF), 5
#define PSMC4BLKF6                       BANKMASK(PSMC4BLKF), 6
#define PSMC4BLKF7                       BANKMASK(PSMC4BLKF), 7
#define PSMC4BLKR0                       BANKMASK(PSMC4BLKR), 0
#define PSMC4BLKR1                       BANKMASK(PSMC4BLKR), 1
#define PSMC4BLKR2                       BANKMASK(PSMC4BLKR), 2
#define PSMC4BLKR3                       BANKMASK(PSMC4BLKR), 3
#define PSMC4BLKR4                       BANKMASK(PSMC4BLKR), 4
#define PSMC4BLKR5                       BANKMASK(PSMC4BLKR), 5
#define PSMC4BLKR6                       BANKMASK(PSMC4BLKR), 6
#define PSMC4BLKR7                       BANKMASK(PSMC4BLKR), 7
#define PSMC4DBF0                        BANKMASK(PSMC4DBF), 0
#define PSMC4DBF1                        BANKMASK(PSMC4DBF), 1
#define PSMC4DBF2                        BANKMASK(PSMC4DBF), 2
#define PSMC4DBF3                        BANKMASK(PSMC4DBF), 3
#define PSMC4DBF4                        BANKMASK(PSMC4DBF), 4
#define PSMC4DBF5                        BANKMASK(PSMC4DBF), 5
#define PSMC4DBF6                        BANKMASK(PSMC4DBF), 6
#define PSMC4DBF7                        BANKMASK(PSMC4DBF), 7
#define PSMC4DBR0                        BANKMASK(PSMC4DBR), 0
#define PSMC4DBR1                        BANKMASK(PSMC4DBR), 1
#define PSMC4DBR2                        BANKMASK(PSMC4DBR), 2
#define PSMC4DBR3                        BANKMASK(PSMC4DBR), 3
#define PSMC4DBR4                        BANKMASK(PSMC4DBR), 4
#define PSMC4DBR5                        BANKMASK(PSMC4DBR), 5
#define PSMC4DBR6                        BANKMASK(PSMC4DBR), 6
#define PSMC4DBR7                        BANKMASK(PSMC4DBR), 7
#define PSMC4DC0                         BANKMASK(PSMC4DCL), 0
#define PSMC4DC1                         BANKMASK(PSMC4DCL), 1
#define PSMC4DC10                        BANKMASK(PSMC4DCH), 2
#define PSMC4DC11                        BANKMASK(PSMC4DCH), 3
#define PSMC4DC12                        BANKMASK(PSMC4DCH), 4
#define PSMC4DC13                        BANKMASK(PSMC4DCH), 5
#define PSMC4DC14                        BANKMASK(PSMC4DCH), 6
#define PSMC4DC15                        BANKMASK(PSMC4DCH), 7
#define PSMC4DC2                         BANKMASK(PSMC4DCL), 2
#define PSMC4DC3                         BANKMASK(PSMC4DCL), 3
#define PSMC4DC4                         BANKMASK(PSMC4DCL), 4
#define PSMC4DC5                         BANKMASK(PSMC4DCL), 5
#define PSMC4DC6                         BANKMASK(PSMC4DCL), 6
#define PSMC4DC7                         BANKMASK(PSMC4DCL), 7
#define PSMC4DC8                         BANKMASK(PSMC4DCH), 0
#define PSMC4DC9                         BANKMASK(PSMC4DCH), 1
#define PSMC4EN                          BANKMASK(PSMC4CON), 7
#define PSMC4FFA0                        BANKMASK(PSMC4FFA), 0
#define PSMC4FFA1                        BANKMASK(PSMC4FFA), 1
#define PSMC4FFA2                        BANKMASK(PSMC4FFA), 2
#define PSMC4FFA3                        BANKMASK(PSMC4FFA), 3
#define PSMC4LD                          BANKMASK(PSMC4CON), 6
#define PSMC4PH0                         BANKMASK(PSMC4PHL), 0
#define PSMC4PH1                         BANKMASK(PSMC4PHL), 1
#define PSMC4PH10                        BANKMASK(PSMC4PHH), 2
#define PSMC4PH11                        BANKMASK(PSMC4PHH), 3
#define PSMC4PH12                        BANKMASK(PSMC4PHH), 4
#define PSMC4PH13                        BANKMASK(PSMC4PHH), 5
#define PSMC4PH14                        BANKMASK(PSMC4PHH), 6
#define PSMC4PH15                        BANKMASK(PSMC4PHH), 7
#define PSMC4PH2                         BANKMASK(PSMC4PHL), 2
#define PSMC4PH3                         BANKMASK(PSMC4PHL), 3
#define PSMC4PH4                         BANKMASK(PSMC4PHL), 4
#define PSMC4PH5                         BANKMASK(PSMC4PHL), 5
#define PSMC4PH6                         BANKMASK(PSMC4PHL), 6
#define PSMC4PH7                         BANKMASK(PSMC4PHL), 7
#define PSMC4PH8                         BANKMASK(PSMC4PHH), 0
#define PSMC4PH9                         BANKMASK(PSMC4PHH), 1
#define PSMC4PR0                         BANKMASK(PSMC4PRL), 0
#define PSMC4PR1                         BANKMASK(PSMC4PRL), 1
#define PSMC4PR10                        BANKMASK(PSMC4PRH), 2
#define PSMC4PR11                        BANKMASK(PSMC4PRH), 3
#define PSMC4PR12                        BANKMASK(PSMC4PRH), 4
#define PSMC4PR13                        BANKMASK(PSMC4PRH), 5
#define PSMC4PR14                        BANKMASK(PSMC4PRH), 6
#define PSMC4PR15                        BANKMASK(PSMC4PRH), 7
#define PSMC4PR2                         BANKMASK(PSMC4PRL), 2
#define PSMC4PR3                         BANKMASK(PSMC4PRL), 3
#define PSMC4PR4                         BANKMASK(PSMC4PRL), 4
#define PSMC4PR5                         BANKMASK(PSMC4PRL), 5
#define PSMC4PR6                         BANKMASK(PSMC4PRL), 6
#define PSMC4PR7                         BANKMASK(PSMC4PRL), 7
#define PSMC4PR8                         BANKMASK(PSMC4PRH), 0
#define PSMC4PR9                         BANKMASK(PSMC4PRH), 1
#define PSMC4SIE                         BANKMASK(PIE4), 3
#define PSMC4SIF                         BANKMASK(PIR4), 3
#define PSMC4TIE                         BANKMASK(PIE4), 7
#define PSMC4TIF                         BANKMASK(PIR4), 7
#define PSMC4TMR0                        BANKMASK(PSMC4TMRL), 0
#define PSMC4TMR1                        BANKMASK(PSMC4TMRL), 1
#define PSMC4TMR10                       BANKMASK(PSMC4TMRH), 2
#define PSMC4TMR11                       BANKMASK(PSMC4TMRH), 3
#define PSMC4TMR12                       BANKMASK(PSMC4TMRH), 4
#define PSMC4TMR13                       BANKMASK(PSMC4TMRH), 5
#define PSMC4TMR14                       BANKMASK(PSMC4TMRH), 6
#define PSMC4TMR15                       BANKMASK(PSMC4TMRH), 7
#define PSMC4TMR2                        BANKMASK(PSMC4TMRL), 2
#define PSMC4TMR3                        BANKMASK(PSMC4TMRL), 3
#define PSMC4TMR4                        BANKMASK(PSMC4TMRL), 4
#define PSMC4TMR5                        BANKMASK(PSMC4TMRL), 5
#define PSMC4TMR6                        BANKMASK(PSMC4TMRL), 6
#define PSMC4TMR7                        BANKMASK(PSMC4TMRL), 7
#define PSMC4TMR8                        BANKMASK(PSMC4TMRH), 0
#define PSMC4TMR9                        BANKMASK(PSMC4TMRH), 1
#define RA0                              BANKMASK(PORTA), 0
#define RA1                              BANKMASK(PORTA), 1
#define RA2                              BANKMASK(PORTA), 2
#define RA3                              BANKMASK(PORTA), 3
#define RA4                              BANKMASK(PORTA), 4
#define RA5                              BANKMASK(PORTA), 5
#define RA6                              BANKMASK(PORTA), 6
#define RA7                              BANKMASK(PORTA), 7
#define RB0                              BANKMASK(PORTB), 0
#define RB1                              BANKMASK(PORTB), 1
#define RB2                              BANKMASK(PORTB), 2
#define RB3                              BANKMASK(PORTB), 3
#define RB4                              BANKMASK(PORTB), 4
#define RB5                              BANKMASK(PORTB), 5
#define RB6                              BANKMASK(PORTB), 6
#define RB7                              BANKMASK(PORTB), 7
#define RC0                              BANKMASK(PORTC), 0
#define RC1                              BANKMASK(PORTC), 1
#define RC2                              BANKMASK(PORTC), 2
#define RC3                              BANKMASK(PORTC), 3
#define RC4                              BANKMASK(PORTC), 4
#define RC5                              BANKMASK(PORTC), 5
#define RC6                              BANKMASK(PORTC), 6
#define RC7                              BANKMASK(PORTC), 7
#define RCEN                             BANKMASK(SSP1CON2), 3
#define RCIDL                            BANKMASK(BAUD1CON), 6
#define RCIE                             BANKMASK(PIE1), 5
#define RCIF                             BANKMASK(PIR1), 5
#define RD                               BANKMASK(EECON1), 0
#define RD0                              BANKMASK(PORTD), 0
#define RD1                              BANKMASK(PORTD), 1
#define RD2                              BANKMASK(PORTD), 2
#define RD3                              BANKMASK(PORTD), 3
#define RD4                              BANKMASK(PORTD), 4
#define RD5                              BANKMASK(PORTD), 5
#define RD6                              BANKMASK(PORTD), 6
#define RD7                              BANKMASK(PORTD), 7
#define RE0                              BANKMASK(PORTE), 0
#define RE1                              BANKMASK(PORTE), 1
#define RE2                              BANKMASK(PORTE), 2
#define RE3                              BANKMASK(PORTE), 3
#define RSEN                             BANKMASK(SSP1CON2), 1
#define RX9                              BANKMASK(RC1STA), 6
#define RX9D                             BANKMASK(RC1STA), 0
#define RXSEL                            BANKMASK(APFCON1), 1
#define R_nW                             BANKMASK(SSP1STAT), 2
#define SBCDE                            BANKMASK(SSP1CON3), 2
#define SBOREN                           BANKMASK(BORCON), 7
#define SCIE                             BANKMASK(SSP1CON3), 5
#define SCKP                             BANKMASK(BAUD1CON), 4
#define SCKSEL                           BANKMASK(APFCON1), 4
#define SCS0                             BANKMASK(OSCCON), 0
#define SCS1                             BANKMASK(OSCCON), 1
#define SDAHT                            BANKMASK(SSP1CON3), 3
#define SDISEL                           BANKMASK(APFCON1), 3
#define SDOSEL                           BANKMASK(APFCON1), 5
#define SEN                              BANKMASK(SSP1CON2), 0
#define SENDB                            BANKMASK(TX1STA), 3
#define SLRCONA0                         BANKMASK(SLRCONA), 0
#define SLRCONA1                         BANKMASK(SLRCONA), 1
#define SLRCONA2                         BANKMASK(SLRCONA), 2
#define SLRCONA3                         BANKMASK(SLRCONA), 3
#define SLRCONA4                         BANKMASK(SLRCONA), 4
#define SLRCONA5                         BANKMASK(SLRCONA), 5
#define SLRCONA6                         BANKMASK(SLRCONA), 6
#define SLRCONA7                         BANKMASK(SLRCONA), 7
#define SLRCONB0                         BANKMASK(SLRCONB), 0
#define SLRCONB1                         BANKMASK(SLRCONB), 1
#define SLRCONB2                         BANKMASK(SLRCONB), 2
#define SLRCONB3                         BANKMASK(SLRCONB), 3
#define SLRCONB4                         BANKMASK(SLRCONB), 4
#define SLRCONB5                         BANKMASK(SLRCONB), 5
#define SLRCONB6                         BANKMASK(SLRCONB), 6
#define SLRCONB7                         BANKMASK(SLRCONB), 7
#define SLRCONC0                         BANKMASK(SLRCONC), 0
#define SLRCONC1                         BANKMASK(SLRCONC), 1
#define SLRCONC2                         BANKMASK(SLRCONC), 2
#define SLRCONC3                         BANKMASK(SLRCONC), 3
#define SLRCONC4                         BANKMASK(SLRCONC), 4
#define SLRCONC5                         BANKMASK(SLRCONC), 5
#define SLRCONC6                         BANKMASK(SLRCONC), 6
#define SLRCONC7                         BANKMASK(SLRCONC), 7
#define SLRCOND0                         BANKMASK(SLRCOND), 0
#define SLRCOND1                         BANKMASK(SLRCOND), 1
#define SLRCOND2                         BANKMASK(SLRCOND), 2
#define SLRCOND3                         BANKMASK(SLRCOND), 3
#define SLRCOND4                         BANKMASK(SLRCOND), 4
#define SLRCOND5                         BANKMASK(SLRCOND), 5
#define SLRCOND6                         BANKMASK(SLRCOND), 6
#define SLRCOND7                         BANKMASK(SLRCOND), 7
#define SLRCONE0                         BANKMASK(SLRCONE), 0
#define SLRCONE1                         BANKMASK(SLRCONE), 1
#define SLRCONE2                         BANKMASK(SLRCONE), 2
#define SMP                              BANKMASK(SSP1STAT), 7
#define SPEN                             BANKMASK(RC1STA), 7
#define SPLLEN                           BANKMASK(OSCCON), 7
#define SREN                             BANKMASK(RC1STA), 5
#define SSP1ADD0                         BANKMASK(SSP1ADD), 0
#define SSP1ADD1                         BANKMASK(SSP1ADD), 1
#define SSP1ADD2                         BANKMASK(SSP1ADD), 2
#define SSP1ADD3                         BANKMASK(SSP1ADD), 3
#define SSP1ADD4                         BANKMASK(SSP1ADD), 4
#define SSP1ADD5                         BANKMASK(SSP1ADD), 5
#define SSP1ADD6                         BANKMASK(SSP1ADD), 6
#define SSP1ADD7                         BANKMASK(SSP1ADD), 7
#define SSP1BUF0                         BANKMASK(SSP1BUF), 0
#define SSP1BUF1                         BANKMASK(SSP1BUF), 1
#define SSP1BUF2                         BANKMASK(SSP1BUF), 2
#define SSP1BUF3                         BANKMASK(SSP1BUF), 3
#define SSP1BUF4                         BANKMASK(SSP1BUF), 4
#define SSP1BUF5                         BANKMASK(SSP1BUF), 5
#define SSP1BUF6                         BANKMASK(SSP1BUF), 6
#define SSP1BUF7                         BANKMASK(SSP1BUF), 7
#define SSP1IE                           BANKMASK(PIE1), 3
#define SSP1IF                           BANKMASK(PIR1), 3
#define SSP1MSK0                         BANKMASK(SSP1MSK), 0
#define SSP1MSK1                         BANKMASK(SSP1MSK), 1
#define SSP1MSK2                         BANKMASK(SSP1MSK), 2
#define SSP1MSK3                         BANKMASK(SSP1MSK), 3
#define SSP1MSK4                         BANKMASK(SSP1MSK), 4
#define SSP1MSK5                         BANKMASK(SSP1MSK), 5
#define SSP1MSK6                         BANKMASK(SSP1MSK), 6
#define SSP1MSK7                         BANKMASK(SSP1MSK), 7
#define SSPEN                            BANKMASK(SSP1CON1), 5
#define SSPM0                            BANKMASK(SSP1CON1), 0
#define SSPM1                            BANKMASK(SSP1CON1), 1
#define SSPM2                            BANKMASK(SSP1CON1), 2
#define SSPM3                            BANKMASK(SSP1CON1), 3
#define SSPOV                            BANKMASK(SSP1CON1), 6
#define STKOVF                           BANKMASK(PCON), 7
#define STKUNF                           BANKMASK(PCON), 6
#define SWDTEN                           BANKMASK(WDTCON), 0
#define SYNC                             BANKMASK(TX1STA), 4
#define T0CS                             BANKMASK(OPTION_REG), 5
#define T0IE                             BANKMASK(INTCON), 5
#define T0IF                             BANKMASK(INTCON), 2
#define T0SE                             BANKMASK(OPTION_REG), 4
#define T1CKPS0                          BANKMASK(T1CON), 4
#define T1CKPS1                          BANKMASK(T1CON), 5
#define T1GGO                            BANKMASK(T1GCON), 3
#define T1GPOL                           BANKMASK(T1GCON), 6
#define T1GSPM                           BANKMASK(T1GCON), 4
#define T1GSS0                           BANKMASK(T1GCON), 0
#define T1GSS1                           BANKMASK(T1GCON), 1
#define T1GTM                            BANKMASK(T1GCON), 5
#define T1GVAL                           BANKMASK(T1GCON), 2
#define T1OSCEN                          BANKMASK(T1CON), 3
#define T1OSCR                           BANKMASK(OSCSTAT), 7
#define T2CKPS0                          BANKMASK(T2CON), 0
#define T2CKPS1                          BANKMASK(T2CON), 1
#define T2OUTPS0                         BANKMASK(T2CON), 3
#define T2OUTPS1                         BANKMASK(T2CON), 4
#define T2OUTPS2                         BANKMASK(T2CON), 5
#define T2OUTPS3                         BANKMASK(T2CON), 6
#define TMR0CS                           BANKMASK(OPTION_REG), 5
#define TMR0IE                           BANKMASK(INTCON), 5
#define TMR0IF                           BANKMASK(INTCON), 2
#define TMR0SE                           BANKMASK(OPTION_REG), 4
#define TMR1CS0                          BANKMASK(T1CON), 6
#define TMR1CS1                          BANKMASK(T1CON), 7
#define TMR1GE                           BANKMASK(T1GCON), 7
#define TMR1GIE                          BANKMASK(PIE1), 7
#define TMR1GIF                          BANKMASK(PIR1), 7
#define TMR1IE                           BANKMASK(PIE1), 0
#define TMR1IF                           BANKMASK(PIR1), 0
#define TMR1ON                           BANKMASK(T1CON), 0
#define TMR2IE                           BANKMASK(PIE1), 1
#define TMR2IF                           BANKMASK(PIR1), 1
#define TMR2ON                           BANKMASK(T2CON), 2
#define TRIGSEL0                         BANKMASK(ADCON2), 4
#define TRIGSEL1                         BANKMASK(ADCON2), 5
#define TRIGSEL2                         BANKMASK(ADCON2), 6
#define TRIGSEL3                         BANKMASK(ADCON2), 7
#define TRISA0                           BANKMASK(TRISA), 0
#define TRISA1                           BANKMASK(TRISA), 1
#define TRISA2                           BANKMASK(TRISA), 2
#define TRISA3                           BANKMASK(TRISA), 3
#define TRISA4                           BANKMASK(TRISA), 4
#define TRISA5                           BANKMASK(TRISA), 5
#define TRISA6                           BANKMASK(TRISA), 6
#define TRISA7                           BANKMASK(TRISA), 7
#define TRISB0                           BANKMASK(TRISB), 0
#define TRISB1                           BANKMASK(TRISB), 1
#define TRISB2                           BANKMASK(TRISB), 2
#define TRISB3                           BANKMASK(TRISB), 3
#define TRISB4                           BANKMASK(TRISB), 4
#define TRISB5                           BANKMASK(TRISB), 5
#define TRISB6                           BANKMASK(TRISB), 6
#define TRISB7                           BANKMASK(TRISB), 7
#define TRISC0                           BANKMASK(TRISC), 0
#define TRISC1                           BANKMASK(TRISC), 1
#define TRISC2                           BANKMASK(TRISC), 2
#define TRISC3                           BANKMASK(TRISC), 3
#define TRISC4                           BANKMASK(TRISC), 4
#define TRISC5                           BANKMASK(TRISC), 5
#define TRISC6                           BANKMASK(TRISC), 6
#define TRISC7                           BANKMASK(TRISC), 7
#define TRISD0                           BANKMASK(TRISD), 0
#define TRISD1                           BANKMASK(TRISD), 1
#define TRISD2                           BANKMASK(TRISD), 2
#define TRISD3                           BANKMASK(TRISD), 3
#define TRISD4                           BANKMASK(TRISD), 4
#define TRISD5                           BANKMASK(TRISD), 5
#define TRISD6                           BANKMASK(TRISD), 6
#define TRISD7                           BANKMASK(TRISD), 7
#define TRISE0                           BANKMASK(TRISE), 0
#define TRISE1                           BANKMASK(TRISE), 1
#define TRISE2                           BANKMASK(TRISE), 2
#define TRISE3                           BANKMASK(TRISE), 3
#define TRMT                             BANKMASK(TX1STA), 1
#define TSEN                             BANKMASK(FVRCON), 5
#define TSRNG                            BANKMASK(FVRCON), 4
#define TUN0                             BANKMASK(OSCTUNE), 0
#define TUN1                             BANKMASK(OSCTUNE), 1
#define TUN2                             BANKMASK(OSCTUNE), 2
#define TUN3                             BANKMASK(OSCTUNE), 3
#define TUN4                             BANKMASK(OSCTUNE), 4
#define TUN5                             BANKMASK(OSCTUNE), 5
#define TX9                              BANKMASK(TX1STA), 6
#define TX9D                             BANKMASK(TX1STA), 0
#define TXEN                             BANKMASK(TX1STA), 5
#define TXIE                             BANKMASK(PIE1), 4
#define TXIF                             BANKMASK(PIR1), 4
#define TXSEL                            BANKMASK(APFCON1), 2
#define UA                               BANKMASK(SSP1STAT), 1
#define WCOL                             BANKMASK(SSP1CON1), 7
#define WDTPS0                           BANKMASK(WDTCON), 1
#define WDTPS1                           BANKMASK(WDTCON), 2
#define WDTPS2                           BANKMASK(WDTCON), 3
#define WDTPS3                           BANKMASK(WDTCON), 4
#define WDTPS4                           BANKMASK(WDTCON), 5
#define WPUA0                            BANKMASK(WPUA), 0
#define WPUA1                            BANKMASK(WPUA), 1
#define WPUA2                            BANKMASK(WPUA), 2
#define WPUA3                            BANKMASK(WPUA), 3
#define WPUA4                            BANKMASK(WPUA), 4
#define WPUA5                            BANKMASK(WPUA), 5
#define WPUA6                            BANKMASK(WPUA), 6
#define WPUA7                            BANKMASK(WPUA), 7
#define WPUB0                            BANKMASK(WPUB), 0
#define WPUB1                            BANKMASK(WPUB), 1
